{
    "xiaowei zhuang": {
        "Sub-diffraction-limit imaging by stochastic optical reconstruction microscopy (STORM)": "\nSub-diffraction-limit imaging by stochastic optical reconstruction microscopy (STORM) | Nature Methods\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYour Privacy\n\n\n\n                    We use cookies to make sure that our website works properly, as well as some ‘optional’ cookies to personalise content and advertising, provide social media features and analyse how people use our site. By accepting some or all optional cookies you give consent to the processing of your personal data, including transfer to third parties, some in countries outside of the European Economic Area that do not offer the same data protection standards as the country where you live. You can decide which optional cookies to accept by clicking on ‘Manage Settings’, where you can also find more information about how your personal data is processed. \n                    Further information can be found in our privacy policy.\n\t\t\t\t\n\n\nAccept all cookies\nManage preferences\n\n\n\n\n\nSkip to main content\n\n\nThank you for visiting nature.com. You are using a browser version with limited support for CSS. To obtain\n            the best experience, we recommend you use a more up to date browser (or turn off compatibility mode in\n            Internet Explorer). In the meantime, to ensure continued support, we are displaying the site without styles\n            and JavaScript.\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nView all journals\n\n\n\n\nSearch\n\n\nSearch\n\nSearch articles by subject, keyword or author\n\n\n\n\n\n\nShow results from\n\nAll journals\nThis journal\n\n\n\nSearch\n\n\n\n\n\n\n                Advanced search\n            \n\nQuick links\n\nExplore articles by subject\nFind a job\nGuide to authors\nEditorial policies\n\n\n\n\n\n\nMy Account\n\n\nLogin\n\n\n\n\n\n\n\n\n\n\n\n\nExplore content\n\n\nExplore content\n\n\n\n                                    Research articles\n                                \n\n\n\n                                    Reviews & Analysis\n                                \n\n\n\n                                    News & Comment\n                                \n\n\n\n                                    Current issue\n                                \n\n\n\n                                    Collections\n                                \n\n\n\n\nFollow us on Twitter\n                            \n\n\nSign up for alerts\n\n\n\n\nRSS feed\n\n\n\n\n\n\n\n\nAbout the journal\n\n\nAbout the journal\n\n\n\n                                    Aims & Scope\n                                \n\n\n\n                                    Journal Information\n                                \n\n\n\n                                    Journal Metrics\n                                \n\n\n\n                                    Our publishing models\n                                \n\n\n\n                                    About the Editors\n                                \n\n\n\n                                    Editorial Values Statement\n                                \n\n\n\n                                    Editorial Policies\n                                \n\n\n\n                                    Content Types\n                                \n\n\n\n                                    Web Feeds\n                                \n\n\n\n                                    Contact\n                                \n\n\n\n\n\n\n\nPublish with us\n\n\nPublish with us\n\n\n\n                                    Submission Guidelines\n                                \n\n\n\n                                    For Reviewers\n                                \n\n\n\n                                    Language editing services\n                                \n\n\nSubmit manuscript\n\n\n\n\n\n\n\n\n\n\nSign up for alerts\n\n\n\n\nRSS feed\n\n\n\n\n\n\n\n\n\n\nnature\n\n\n\nnature methods\n\n\n\nbrief communications\n\n\n\n\narticle\n\n\n\n\n\n\n\n\n\n                        Sub-diffraction-limit imaging by stochastic optical reconstruction microscopy (STORM)\n                    \n\n\nDownload PDF\n\n\n\n\n\n\n\n\n\nPublished: 09 August 2006\n\nSub-diffraction-limit imaging by stochastic optical reconstruction microscopy (STORM)\nMichael J Rust1 na1, Mark Bates2 na1 & Xiaowei Zhuang1,3,4 \n\nNature Methods\nvolume 3, pages 793–796 (2006)Cite this article\n\n\n\n\n47k Accesses\n\n\n5324 Citations\n\n\n101 Altmetric\n\n\nMetrics details\n\n\n\n\n\n\nAbstractWe have developed a high-resolution fluorescence microscopy method based on high-accuracy localization of photoswitchable fluorophores. In each imaging cycle, only a fraction of the fluorophores were turned on, allowing their positions to be determined with nanometer accuracy. The fluorophore positions obtained from a series of imaging cycles were used to reconstruct the overall image. We demonstrated an imaging resolution of 20 nm. This technique can, in principle, reach molecular-scale resolution.\n\n\nYou have full access to this article via your institution.\n\n\nDownload PDF\n\n\n\n\n\n\n\nYou have full access to this article via Gordon Library, WPI\n\n\nDownload PDF\n\n\n\n\n\n\nMainFluorescence microscopy is widely used in molecular and cell biology for noninvasive, time-resolved imaging with high biochemical specificity. Despite these advantages, standard fluorescence microscopy is not useful for ultra-structural imaging owing to a resolution limit set by the diffraction of light. Several approaches have been used to break this diffraction limit, including near-field scanning optical microscopy (NSOM)1, multiphoton fluorescence2, stimulated emission depletion (STED)3 and saturated structured-illumination microscopy (SSIM)4. NSOM, STED and SSIM have all achieved lateral resolution of tens of nanometers, substantially lower than the wavelength of light, but each with its own limitations. NSOM is difficult to operate in a noninvasive mode and has a low imaging depth. Multiphoton microscopy, STED and SSIM are based on nonlinear optical effects, and typically require the use of high-intensity pulsed lasers, which can induce sample damage. A continuing effort to develop existing4,5 and new techniques is needed to harness the benefits of fluorescence microscopy for ultraresolution biological imaging.Single-molecule detection offers new possibilities for obtaining sub-diffraction-limit spatial resolution. The position of a single emitter can be determined to almost arbitrarily high accuracy if a sufficient number of photons are collected6,7,8,9. Based on this principle, fluorescence imaging with one-nanometer accuracy (FIONA) has recently been demonstrated at the single-molecule level at room temperature9. Unfortunately, the localization accuracy of FIONA does not directly translate into imaging resolution as multiple emitters in close proximity will still be difficult to resolve. This issue has been addressed in part by taking advantage of photobleaching of single dyes or photoblinking of quantum dots to distinguish their individual signals10,11,12,13. These approaches had been used to resolve 2–5 fluorophores within a diffraction-limited spot, but extending these techniques to more than a few fluorophores remains a challenge.In this work we report a new high-resolution imaging technique, stochastic optical reconstruction microscopy (STORM), in which a fluorescence image is constructed from high-accuracy localization of individual fluorescent molecules that are switched on and off using light of different colors. The STORM imaging process consists of a series of imaging cycles (Fig. 1a). In each cycle, only a fraction of the fluorophores in the field of view are switched on, such that each of the active fluorophores is optically resolvable from the rest, that is, their images are not overlapping. This allows the position of these fluorophores to be determined with high accuracy. Repeating this process for multiple cycles, each causing a stochastically different subset of fluorophores to be turned on, allows the positions of many fluorophores to be determined and thus an overall image to be reconstructed. In the examples below we demonstrated an imaging resolution of approximately 20 nm using a simple total-internal-reflection fluorescence microscope, low-power continuous-wave lasers and a photoswitchable cyanine dye14,15.Figure 1: STORM with photo-switchable fluorophores.(a) A STORM imaging sequence using a hypothetical hexameric object labeled with red fluorophores that can be switched between a fluorescent and a dark state by a red and green laser, respectively. All fluorophores are first switched to the dark state by a strong red laser pulse. In each imaging cycle, a green laser pulse is used to switch on only a fraction of the fluorophores to give an optically resolvable set of active fluorophores. Next, under red illumination, these molecules emit fluorescence until they are switched off, allowing their positions (white crosses) to be determined with high accuracy. The overall image is then reconstructed from the fluorophore positions obtained from multiple imaging cycles. (b) A single Cy5 switch on DNA can be turned on and off for hundreds of cycles before being permanently photobleached. A red laser (633 nm, 30 W/cm2) is used to excite fluorescence (black line) from Cy5 and to switch Cy5 to the dark state. A green laser (532 nm, 1 W/cm2) is used to return Cy5 to the fluorescent state. The alternating red and green line indicates the laser excitation pattern.Full size imageWe have recently reported that a cyanine dye, Cy5, can be switched between a fluorescent and a dark state in a controlled and reversible manner by light of different wavelengths14. Red laser light that produces fluorescent emission from Cy5 can also switch the dye to a stable dark state. Exposure to green laser light converts Cy5 back to the fluorescent state, but the recovery rate depends critically on the close proximity of a secondary dye, Cy3 (ref. 14). Hereafter, we refer to the Cy3-Cy5 dye pair simply as a switch. Under illumination conditions allowing single-molecule detection, we found that such a switch, when attached to nucleic acids or proteins, can be cycled on and off hundreds of times before permanent photobleaching occurs (Fig. 1b and Supplementary Fig. 1 online).Here we demonstrate the concept of STORM using the cyanine switch, but in principle any suitable optically switched fluorophore could be used. The resolution of STORM is limited by the accuracy with which individual switches can be localized during a switching cycle. To determine the localization accuracy, we attached a switch to a short double-stranded DNA, which was surface-immobilized at low density so that single switches were clearly resolvable. These switches were periodically cycled on and off using green and red laser light; the red laser also served to excite fluorescence from Cy5. No fluorescence from Cy3 was recorded in this process. The fluorescence image from a single switch gave the point-spread function shown in Figure 2a. A Gaussian fit to this image was used to localize the position of the switch. The positions determined from multiple switching cycles showed a substantial spread (Fig. 2b), which was considerably reduced by correcting for sample drift over the course of the experiment (Fig. 2c and Supplementary Methods online). The standard deviation of the drift-corrected positions obtained from 20 imaging cycles is on average 8 nm for individual switches (Fig. 2d). This value gives a measure of the uncertainty in the localization of a single switch per imaging cycle. Correspondingly, the experimentally measured spread of switch positions follows a Gaussian distribution with a full-width half maximum of 18 nm, as expected from the 8 nm standard deviation (Supplementary Fig. 2 online). Therefore, under our present imaging conditions, two switches separated by 20 nm should be resolvable.Figure 2: The high localization accuracy of individual switches during each switching cycle defines the intrinsic resolution of STORM.(a) The point spread function (PSF) of the emission from a single switch on DNA during a single switching cycle. Fitting the PSF to a two-dimensional Gaussian (not shown) gives the centroid position of the PSF. (b,c) The centroid positions of an individual switch determined in 20 successive imaging cycles before (b) and after (c) correction for sample drift. Scale bars, 20 nm. (d) A histogram of the standard deviation of centroid positions. The standard deviation is determined as (σx + σy) / 2 for each switch using 20 imaging cycles, where σx and σy are the standard deviations of the centroid positions in the x and y dimensions. This histogram was constructed from 29 switches.Full size imageTo demonstrate the capability of STORM to resolve fluorescent molecules in close proximity, we constructed standard samples of linear, double-stranded DNA labeled with multiple switches separated by a well-defined number of base pairs. We also labeled the DNA strands with multiple biotins and attached them to a high-density streptavidin layer, increasing the likelihood of multiple attachments between the DNA and the surface, so that the DNA is immobilized in the plane. We first examined DNA strands containing two switches separated by 135 base pairs (Fig. 3a and Supplementary Fig. 3 online), corresponding to a length of 46 nm along the DNA contour. A STORM image obtained using the imaging procedure described above shows two clusters of measured switch positions, indicating that the two switches are well resolved (Fig. 3a). The distance between the centers of the two clouds had a mean value of 41 nm (Fig. 3b), in quantitative agreement with the theoretical mean (40 nm) determined using the known contour and persistence lengths of the DNA sample. We also imaged longer DNA samples labeled with four switches evenly separated by 46 nm along the contour. The STORM images indeed reveal four clusters of switch positions following a bent contour consistent with the persistence length of DNA (a measure of flexibility) and the engineered separation between the switches (Fig. 3c). These results indicate that STORM can image biological samples with sub-diffraction-limit resolution, and that features separated by 40 nm are well within our resolving power.Figure 3: STORM can resolve structures with sub-diffraction-limit resolution.(a) STORM cleanly resolves two switches separated by a contour length of 46 nm on dsDNA. The DNA construct is illustrated on the left; example STORM images of three individual DNA samples are shown on the right. The STORM images show two clearly separated clusters of measured switch positions (crosses), each corresponding to a single switch. The center-of-mass position of each cluster is marked by a red dot. The inter-switch distances are 46 nm, 44 nm and 34 nm for these three examples. Scale bars, 20 nm. (b) Comparison between the inter-switch distances measured using STORM (columns) and the predicted distance distribution considering the flexibility of DNA (dashed line). (c) STORM images of four switches attached to a dsDNA, pair-wise separated by a contour length of 46 nm. The measured switch positions are clustered by an automated algorithm and different clusters are indicated by different symbols. Scale bars, 20 nm. (d) STORM images of RecA-coated circular plasmid DNA. Indirect immunofluorescence images with switch-labeled secondary antibody taken by a total internal reflection microscope (top); the reconstructed STORM images of the same filaments (bottom). Scale bars, 300 nm.Full size imageA distinct advantage of STORM is its ability to localize a large number of switches within a diffraction-limited spot by cycling the switches on and off in a controlled manner, allowing this to be used as a general biological imaging technique. To demonstrate this capability, we prepared circular DNA plasmids coated with RecA protein and imaged them using indirect immunofluorescence with switch-labeled secondary antibody (Fig. 3d). STORM images of the RecA filaments reveal their circular structure with greatly increased resolution when compared with wide-field images. Parts of the filament appear to be unlabeled or kinked, possibly corresponding to regions of the plasmid that remain uncoated by RecA.In summary, we have demonstrated that STORM is capable of imaging biological structures with sub-diffraction-limit resolution. The resolution of the technique is limited in principle only by the number of photons emitted per switch cycle, but not the wavelength of light. For the cyanine switch, we have detected ∼3,000 photons per switching cycle, independent of red-laser intensity (data not shown), predicting a theoretical localization accuracy of 4 nm8. The discrepancy between this theoretical prediction and our measured accuracy of 8 nm is most likely due to imperfect correction of stage drift and aberration owing to focus drift in our measurements. This measured localization accuracy corresponds to an imaging resolution of approximately 20 nm. Indeed, fluorescent switches separated by ∼40 nm have been clearly resolved (Fig. 3). The cyanine switches can be turned on and off reliably for hundreds of cycles before photobleaching, allowing STORM to be used for resolving structures with many fluorophores in a potentially time-resolved manner. The circular structure of RecA filaments containing 10–20 switches can be resolved in a few minutes. The imaging speed may be improved by increasing the switching rate through stronger excitation or fluorophores with faster switching kinetics. We expect that STORM will be a valuable tool for high-resolution fluorescence in situ hybridization and immunofluorescence imaging. The STORM concept is also applicable to other photoswitchable fluorophores and fluorescent proteins, which will potentially allow high-resolution live-cell imaging.Note: \nSupplementary information\n is available on the Nature Methods website.\n\n\nReferencesPohl, D.W. & Courjon, D. Near Field Optics (Kluwer, Dordrecht, 1993).Book \n    \n                    Google Scholar \n                Zipfel, W.R., Williams, R.M. & Webb, W.W. Nat. Biotechnol. 21, 1368–1376 (2003).Article \n    \n                    Google Scholar \n                Hell, S.W. Nat. Biotechnol. 21, 1347–1355 (2003).Article \n    CAS \n    \n                    Google Scholar \n                Gustafsson, M.G.L. Proc. Natl. Acad. Sci. USA 102, 13081–13086 (2005).Article \n    CAS \n    \n                    Google Scholar \n                Hofmann, M., Eggeling, C., Jakobs, S. & Hell, S.W. Proc. Natl. Acad. Sci. USA 102, 17565–17569 (2005).Article \n    CAS \n    \n                    Google Scholar \n                Gelles, J., Schnapp, B.J. & Sheetz, M.P. Nature 331, 450–453 (1988).Article \n    CAS \n    \n                    Google Scholar \n                van Oijen, A.M., Kohler, J., Schmidt, J., Muller, M. & Brakenhoff, G.J. Chem. Phys. Lett. 292, 183–187 (1998).Article \n    CAS \n    \n                    Google Scholar \n                Thompson, R.E., Larson, D.R. & Webb, W.W. Biophys. J. 82, 2775–2783 (2002).Article \n    CAS \n    \n                    Google Scholar \n                Yildiz, A.  et al. Science 300, 2061–2065 (2003).Article \n    CAS \n    \n                    Google Scholar \n                Gordon, M.P., Ha, T. & Selvin, P.R. Proc. Natl. Acad. Sci. USA 101, 6462–6465 (2004).Article \n    CAS \n    \n                    Google Scholar \n                Qu, X., Wu, D., Mets, L. & Scherer, N.F. Proc. Natl. Acad. Sci. USA 101, 11298–11303 (2004).Article \n    CAS \n    \n                    Google Scholar \n                Lidke, K.A., Rieger, B., Jovin, T.M. & Heintzmann, R. Opt. Express 13, 7052–7062 (2005).Article \n    \n                    Google Scholar \n                Ram, S., Ward, E.S. & Ober, R.J. Proc. Natl. Acad. Sci. USA 103, 4457–4462 (2006).Article \n    CAS \n    \n                    Google Scholar \n                Bates, M., Blosser, T.R. & Zhuang, X. Phys. Rev. Lett. 94, 108101 (2005).Article \n    \n                    Google Scholar \n                Heilemann, M., Margeat, E., Kasper, R., Sauer, M. & Tinnefeld, P. J. Am. Chem. Soc. 127, 3801–3806 (2005).Article \n    CAS \n    \n                    Google Scholar \n                Download referencesAcknowledgementsThis work is supported by in part by the US National Institutes of Health, the Defense Advance Research Projects Agency and a Packard Science and Engineering Fellowship (to X.Z.). X.Z. is a Howard Hughes Medical Institute Investigator.Author informationAuthor notesMichael J Rust and Mark Bates: These authors contributed equally to this work.Authors and AffiliationsDepartment of Physics, Harvard University, 12 Oxford Street, Cambridge, 02138, Massachusetts, USAMichael J Rust & Xiaowei ZhuangDivision of Engineering and Applied Sciences, Harvard University, 12 Oxford Street, Cambridge, 02138, Massachusetts, USAMark BatesDepartment of Chemistry and Chemical Biology, Harvard University, 12 Oxford Street, Cambridge, 02138, Massachusetts, USAXiaowei ZhuangHoward Hughes Medical Institute, Harvard University, 12 Oxford Street, Cambridge, 02138, Massachusetts, USAXiaowei ZhuangAuthorsMichael J RustView author publicationsYou can also search for this author in\n                        PubMed Google ScholarMark BatesView author publicationsYou can also search for this author in\n                        PubMed Google ScholarXiaowei ZhuangView author publicationsYou can also search for this author in\n                        PubMed Google ScholarContributionsM.J.R. and M.B. conceived the STORM imaging concept. M.J.R., DNA imaging and data analysis; M.B., RecA imaging and data acquisition. X.Z. supervised the project.Corresponding authorCorrespondence to\n                Xiaowei Zhuang.Ethics declarations\nCompeting interests\nThe authors declare no competing financial interests.\nSupplementary informationSupplementary Fig. 1Switching of Cy3-Cy5–labeled antibody. (PDF 45 kb)Supplementary Fig. 2Localization accuracy of single switches before and after drift correction. (PDF 49 kb)Supplementary Fig. 3Fluorescence time trace of DNA labeled with multiple switches over many STORM imaging cycles. (PDF 78 kb)Supplementary Methods (PDF 50 kb)Rights and permissionsReprints and PermissionsAbout this articleCite this articleRust, M., Bates, M. & Zhuang, X. Sub-diffraction-limit imaging by stochastic optical reconstruction microscopy (STORM).\n                    Nat Methods 3, 793–796 (2006). https://doi.org/10.1038/nmeth929Download citationReceived: 07 July 2006Accepted: 31 July 2006Published: 09 August 2006Issue Date: October 2006DOI: https://doi.org/10.1038/nmeth929Share this articleAnyone you share the following link with will be able to read this content:Get shareable linkSorry, a shareable link is not currently available for this article.Copy to clipboard\n                            Provided by the Springer Nature SharedIt content-sharing initiative\n                        \n\n\n\nThis article is cited by\n\n\n\n\n\n                                        Nanoscale fluorescence imaging of biological ultrastructure via molecular anchoring and physical expansion\n                                    \n\n\nWei WangYat Ho ChanRuixuan Gao\n\nNano Convergence (2022)\n\n\n\n\n                                        Two-photon MINFLUX with doubled localization precision\n                                    \n\n\nKun ZhaoXinzhu XuPeng Xi\n\neLight (2022)\n\n\n\n\n                                        Fully-automated and ultra-fast cell-type identification using specific marker combinations from single-cell transcriptomic data\n                                    \n\n\nAleksandr IanevskiAnil K. GiriTero Aittokallio\n\nNature Communications (2022)\n\n\n\n\n                                        Picasso-server: a community-based, open-source processing framework for super-resolution data\n                                    \n\n\nMaximilian T. Strauss\n\nCommunications Biology (2022)\n\n\n\n\n                                        Proteomic and functional analyses of the periodic membrane skeleton in neurons\n                                    \n\n\nRuobo ZhouBoran HanXiaowei Zhuang\n\nNature Communications (2022)\n\n\n\n\n\n\n\n\n\n\n\n\n\nYou have full access to this article via your institution.\n\n\nDownload PDF\n\n\n\n\n\n\n\nYou have full access to this article via Gordon Library, WPI\n\n\nDownload PDF\n\n\n\n\n\n\n\n\nAssociated Content\n\n\n\n\n\nSingle-molecule mountains yield nanoscale cell images\n\n\nW E Moerner\n\n\nNature Methods\nNews & Views\n01 Oct 2006\n\n\n\n\n\n\n\n\n\nSectionsFiguresReferencesAbstractMainReferencesAcknowledgementsAuthor informationEthics declarationsSupplementary informationRights and permissionsAbout this articleThis article is cited by\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\nFigure 1: STORM with photo-switchable fluorophores.View in articleFull size imageFigure 2: The high localization accuracy of individual switches during each switching cycle defines the intrinsic resolution of STORM.View in articleFull size imageFigure 3: STORM can resolve structures with sub-diffraction-limit resolution.View in articleFull size image\nPohl, D.W. & Courjon, D. Near Field Optics (Kluwer, Dordrecht, 1993).Book \n                    Google Scholar Zipfel, W.R., Williams, R.M. & Webb, W.W. Nat. Biotechnol. 21, 1368–1376 (2003).Article \n                    Google Scholar Hell, S.W. Nat. Biotechnol. 21, 1347–1355 (2003).Article CAS \n                    Google Scholar Gustafsson, M.G.L. Proc. Natl. Acad. Sci. USA 102, 13081–13086 (2005).Article CAS \n                    Google Scholar Hofmann, M., Eggeling, C., Jakobs, S. & Hell, S.W. Proc. Natl. Acad. Sci. USA 102, 17565–17569 (2005).Article CAS \n                    Google Scholar Gelles, J., Schnapp, B.J. & Sheetz, M.P. Nature 331, 450–453 (1988).Article CAS \n                    Google Scholar van Oijen, A.M., Kohler, J., Schmidt, J., Muller, M. & Brakenhoff, G.J. Chem. Phys. Lett. 292, 183–187 (1998).Article CAS \n                    Google Scholar Thompson, R.E., Larson, D.R. & Webb, W.W. Biophys. J. 82, 2775–2783 (2002).Article CAS \n                    Google Scholar Yildiz, A.  et al. Science 300, 2061–2065 (2003).Article CAS \n                    Google Scholar Gordon, M.P., Ha, T. & Selvin, P.R. Proc. Natl. Acad. Sci. USA 101, 6462–6465 (2004).Article CAS \n                    Google Scholar Qu, X., Wu, D., Mets, L. & Scherer, N.F. Proc. Natl. Acad. Sci. USA 101, 11298–11303 (2004).Article CAS \n                    Google Scholar Lidke, K.A., Rieger, B., Jovin, T.M. & Heintzmann, R. Opt. Express 13, 7052–7062 (2005).Article \n                    Google Scholar Ram, S., Ward, E.S. & Ober, R.J. Proc. Natl. Acad. Sci. USA 103, 4457–4462 (2006).Article CAS \n                    Google Scholar Bates, M., Blosser, T.R. & Zhuang, X. Phys. Rev. Lett. 94, 108101 (2005).Article \n                    Google Scholar Heilemann, M., Margeat, E., Kasper, R., Sauer, M. & Tinnefeld, P. J. Am. Chem. Soc. 127, 3801–3806 (2005).Article CAS \n                    Google Scholar \n\n\n\n\n\n\n\n\n\n\n\n                    Nature Methods (Nat Methods)\n                \n\nISSN 1548-7105 (online)\n    \n\nISSN 1548-7091 (print)\n    \n\n\n\n\n\n\n\n\nnature.com sitemap\n\n\n\n\n\nAbout us\nPress releases\nPress office\nContact us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDiscover content\n\nJournals A-Z\nArticles by subject\nNano\nProtocol Exchange\nNature Index\n\n\n\nPublishing policies\n\nNature portfolio policies\nOpen access\n\n\n\nAuthor & Researcher services\n\nReprints & permissions\nResearch data\nLanguage editing\nScientific editing\nNature Masterclasses\nNature Research Academies\nResearch Solutions\n\n\n\nLibraries & institutions\n\nLibrarian service & tools\nLibrarian portal\nOpen research\nRecommend to library\n\n\n\nAdvertising & partnerships\n\nAdvertising\nPartnerships & Services\nMedia kits\nBranded content\n\n\n\nCareer development\n\nNature Careers\nNature  Conferences\nNature  events\n\n\n\nRegional websites\n\nNature Africa\nNature China\nNature India\nNature Italy\nNature Japan\nNature Korea\nNature Middle East\n\n\n\nLegal & Privacy\n\nPrivacy Policy\nUse of cookies\nManage cookies/Do not sell my data\nLegal notice\nAccessibility statement\nTerms & Conditions\nCalifornia Privacy Statement\n\n\n\n\n\n\n\n\n\n\n© 2022 Springer Nature Limited\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose banner\n\n\n\n\n\n\nClose\n\n\n\n\n\n\nSign up for the Nature Briefing newsletter — what matters in science, free to your inbox daily.\n\n\n\n\n\nEmail address\n\n\nSign up\n\n\n\nI agree my information will be processed in accordance with the Nature and Springer Nature Limited Privacy Policy.\n\n\n\n\n\n\n\n\n\n\nClose banner\n\n\n\n\n\n\nClose\n\n\n\nGet the most important science stories of the day, free in your inbox.\nSign up for Nature Briefing\n            \n\n\n\n\n\n\n\n\n\n\n"
    }
}