{
    "dylan cable": {
        "Robust decomposition of cell type mixtures in spatial transcriptomics": "\nRobust decomposition of cell type mixtures in spatial transcriptomics | Nature Biotechnology\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYour Privacy\n\n\n\n                    We use cookies to make sure that our website works properly, as well as some ‘optional’ cookies to personalise content and advertising, provide social media features and analyse how people use our site. By accepting some or all optional cookies you give consent to the processing of your personal data, including transfer to third parties, some in countries outside of the European Economic Area that do not offer the same data protection standards as the country where you live. You can decide which optional cookies to accept by clicking on ‘Manage Settings’, where you can also find more information about how your personal data is processed. \n                    Further information can be found in our privacy policy.\n\t\t\t\t\n\n\nAccept all cookies\nManage preferences\n\n\n\n\n\nSkip to main content\n\n\nThank you for visiting nature.com. You are using a browser version with limited support for CSS. To obtain\n            the best experience, we recommend you use a more up to date browser (or turn off compatibility mode in\n            Internet Explorer). In the meantime, to ensure continued support, we are displaying the site without styles\n            and JavaScript.\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nView all journals\n\n\n\n\nSearch\n\n\nSearch\n\nSearch articles by subject, keyword or author\n\n\n\n\n\n\nShow results from\n\nAll journals\nThis journal\n\n\n\nSearch\n\n\n\n\n\n\n                Advanced search\n            \n\nQuick links\n\nExplore articles by subject\nFind a job\nGuide to authors\nEditorial policies\n\n\n\n\n\n\nMy Account\n\n\nLogin\n\n\n\n\n\n\n\n\n\n\n\n\nExplore content\n\n\nExplore content\n\n\n\n                                    Research articles\n                                \n\n\n\n                                    Reviews & Analysis\n                                \n\n\n\n                                    News & Comment\n                                \n\n\n\n                                    Podcasts\n                                \n\n\n\n                                    Videos\n                                \n\n\n\n                                    Current issue\n                                \n\n\n\n                                    Collections\n                                \n\n\n\n\nFollow us on Facebook\n                            \n\n\nFollow us on Twitter\n                            \n\n\nSign up for alerts\n\n\n\n\nRSS feed\n\n\n\n\n\n\n\n\nAbout the journal\n\n\nAbout the journal\n\n\n\n                                    Aims & Scope\n                                \n\n\n\n                                    Journal Information\n                                \n\n\n\n                                    Journal Metrics\n                                \n\n\n\n                                    About the Editors\n                                \n\n\n\n                                    Our publishing models\n                                \n\n\n\n                                    Editorial Values Statement\n                                \n\n\n\n                                    Editorial Policies\n                                \n\n\n\n                                    Content Types\n                                \n\n\n\n                                    Web Feeds\n                                \n\n\n\n                                    Posters\n                                \n\n\n\n                                    Contact\n                                \n\n\n\n\n\n\n\nPublish with us\n\n\nPublish with us\n\n\n\n                                    Submission Guidelines\n                                \n\n\n\n                                    For Reviewers\n                                \n\n\n\n                                    Language editing services\n                                \n\n\nSubmit manuscript\n\n\n\n\n\n\n\n\n\n\nSign up for alerts\n\n\n\n\nRSS feed\n\n\n\n\n\n\n\n\n\n\nnature\n\n\n\nnature biotechnology\n\n\n\narticles\n\n\n\n\narticle\n\n\n\n\n\n\n\n\n\n                        Robust decomposition of cell type mixtures in spatial transcriptomics\n                    \n\n\nDownload PDF\n\n\n\n\n\n\n\n\n\nArticle\nPublished: 18 February 2021\n\nRobust decomposition of cell type mixtures in spatial transcriptomics\nDylan M. Cable1,2,3, Evan Murray2, Luli S. Zou2,3,4, Aleksandrina Goeva2, Evan Z. Macosko \n            ORCID: orcid.org/0000-0002-2794-51652,5, Fei Chen \n            ORCID: orcid.org/0000-0003-2308-36492,6 na1 & …Rafael A. Irizarry \n            ORCID: orcid.org/0000-0002-3944-43093,4 na1 Show authors\n\nNature Biotechnology\nvolume 40, pages 517–526 (2022)Cite this article\n\n\n\n\n24k Accesses\n\n\n73 Citations\n\n\n106 Altmetric\n\n\nMetrics details\n\n\n\n\n\n\nAbstractA limitation of spatial transcriptomics technologies is that individual measurements may contain contributions from multiple cells, hindering the discovery of cell-type-specific spatial patterns of localization and expression. Here, we develop robust cell type decomposition (RCTD), a computational method that leverages cell type profiles learned from single-cell RNA-seq to decompose cell type mixtures while correcting for differences across sequencing technologies. We demonstrate the ability of RCTD to detect mixtures and identify cell types on simulated datasets. Furthermore, RCTD accurately reproduces known cell type and subtype localization patterns in Slide-seq and Visium datasets of the mouse brain. Finally, we show how RCTD’s recovery of cell type localization enables the discovery of genes within a cell type whose expression depends on spatial environment. Spatial mapping of cell types with RCTD enables the spatial components of cellular identity to be defined, uncovering new principles of cellular organization in biological tissue. RCTD is publicly available as an open-source R package at https://github.com/dmcable/RCTD.\n\n\nYou have full access to this article via your institution.\n\n\nDownload PDF\n\n\n\n\n\n\n\nYou have full access to this article via Gordon Library, WPI\n\n\nDownload PDF\n\n\n\n\n\n\nMainTissues are composed of diverse cell types and states whose spatial organization governs interaction and function. Recent advances in spatial transcriptomics technologies1,2,3 have enabled high-throughput collection of RNA sequencing coupled with spatial information in biological tissues. Using such technologies to spatially map cell types is fundamental to understanding of tissue structure. In particular, knowledge of spatial localization of specific cellular subtypes remains incomplete and laborious to obtain4,5.Spatial transcriptomics technologies have the potential to elucidate interactions between the cellular environment and gene expression, augmenting knowledge of healthy functions and disease states of tissues. Spatial transcriptomics data are composed of gene expression counts for each of the spatial measurement locations, here referred to as pixels, that tile a two-dimensional (2D) surface. A common task of interest is identifying genes with expression varying across space. Current computational methods search for spatial patterns in gene expression without stratifying by cell type6,7,8. However, much of the variation detected by these methods may be driven by varying cell type composition across the spatial landscape, as single-cell RNA sequencing (scRNA-seq) studies have revealed that cell type can explain a majority of the variation within a population of cells9,10. It is therefore necessary to consider cell type information when searching for spatial gene expression patterns.Assignment of cell types is analytically challenging even for high-resolution approaches, such as Slide-seq, due to the fact that although pixel resolution can approach the size of mammalian cells (for example, Slide-seq, 10 µm)11, fixed pixel locations may overlap with multiple cells. As a result, gene expression measurements at a single pixel may be the result of a mixture of multiple cell types. Currently, the most widely used approach to identifying cell types relies on unsupervised clustering12; however, this approach does not allow for the possibility of cell type mixtures. A fundamental challenge is thus to correctly identify these mixture pixels as a combination of multiple cell types, permitting a more complete characterization of the spatial localization of cell types in spatial transcriptomics.Several recent methods have used scRNA-seq references to predict cell types on spatial transcriptomics data11,13; however, some do not statistically model platform effects, Poisson sampling and overdispersed counts11 despite recent evidence that methods in scRNA-seq data analysis accounting for these aspects of gene expression count data outperform those assuming normality14,15. Others have not yet been demonstrated to scale to large datasets, such as those obtained by Slide-seq, and they perform cell type enrichment testing at the level of regions rather than individual pixels13.Here, we introduce RCTD, a supervised learning approach to decompose RNA sequencing mixtures into single cell types, enabling the assignment of cell types to spatial transcriptomic pixels. Specifically, we leverage annotated scRNA-seq data to define cell-type-specific profiles for the cell types expected to be present in the spatial transcriptomics data. Several supervised cell type assignment methods have achieved high accuracy in scRNA-seq12,16 but are not designed for mixtures of multiple cell types. RCTD fits a statistical model that estimates mixtures of cell types at each pixel.A pertinent challenge for supervised cell type learning is what we term platform effects, the effects of technology-dependent library preparation on the capture rate of individual genes between sequencing platforms. We show that, if these platform effects are not accounted for, supervised methods are unlikely to succeed because systematic technical variability dominates relevant biological signals17. These effects have been previously found in comparisons between single-cell and single-nucleus RNA-seq (snRNA-seq) on the same biological sample18, where it has been shown that, for example, nucleus-localized genes are enriched in snRNA-seq. Here, we demonstrate that platform effects between the scRNA-seq reference and spatial transcriptomics target present a challenge when transferring cell type knowledge to spatial transcriptomics. To enable cross-platform learning in RCTD, we have developed and validated a platform effect normalization procedure.We demonstrate that RCTD can accurately discover the localization of cell types in both simulated and real spatial transcriptomic data. Furthermore, we show that RCTD can detect subtle transcriptomic differences to spatially map cellular subtypes. Finally, we use RCTD to compute expected cell-type-specific gene expression, which enables the detection of changes in gene expression based on the spatial environment of a cell. Below, we demonstrate how RCTD learns mixtures of cell types in spatial transcriptomics data, facilitating quantification of the effect of spatial position and local cellular environment on gene expression within a cell type.ResultsChallenges in spatial transcriptomics: cell type mixtures and platform effectsSpatial transcriptomics pixels source RNA from multiple, rather than single, cells, creating a challenge for cell type learning. In Slide-seq cerebellum data, we found that the most widely used approach for scRNA-seq cell type identification, unsupervised clustering12, incorrectly classifies cell types that colocalize spatially but are not similar transcriptionally. For example, Bergmann and Purkinje cells spatially colocalize to the same layer, resulting in a population of pixels that possesses marker genes from both cell types (Fig. 1a). The most likely explanation for this observation is that these pixels contain two or more cells of different types, but unsupervised clustering assigns these doublet pixels to just one cell type. Moreover, this approach predicts granule cells not exclusively in the granular layer, with many cells incorrectly predicted inside the molecular layer and oligodendrocyte layer and possessing low granule cell marker expression (Fig. 1b,c and Supplementary Figs. 1 and 2).Fig. 1: Spatial transcriptomics data present challenges for cell type learning.a, Expression of Bergmann and Purkinje cell marker genes for pixels colored by unsupervised clustering cell type assignment within a Slide-seq cerebellum dataset. For example, the Bergmann cell markers axis is the sum of the expression (counts per 500) of Bergmann cell differentially expressed genes. b, Expression (counts per 500) of granule cell marker genes in Slide-seq; scale bar, 250 µm. c, Spatial plot of granule cells identified by unsupervised clustering. Pixels are colored by whether they spatially belong to the granule cell layer; scale bar, 250 µm. d, Confusion matrix of true versus predicted cell types within a training dataset (snRNA-seq) by non-negative least squares regression. Color represents the proportion of the cell type on the x axis classified as the cell type on the y axis. The diagonal line representing ground truth is boxed in red. e, Confusion matrix of cell type predictions across platforms using non-negative least-squares regression trained on snRNA-seq data and tested on scRNA-seq data. The same color scale was used as in d. f, Density plot across genes of measured platform effects between cerebellum scRNA-seq and snRNA-seq data. The platform effect is defined as the log2 ratio of average gene expression between platforms. UBCs, unipolar brush cells.Full size imageAn additional challenge, platform effects, arises in applying supervised learning, in which scRNA-seq cell type profiles are leveraged to classify spatial transcriptomic cell types. For instance, a standard supervised learning approach trained on an assessment snRNA-seq cerebellum dataset with known cell types obtained much higher accuracy in the training platform than the testing platform, an scRNA-seq cerebellum dataset (Fig. 1d,e). This difference is explained by the presence of platform effects, which can cause gene expression to change multiplicatively between snRNA-seq and scRNA-seq (Fig. 1f). NMFreg, a supervised cell type mixture assignment algorithm previously developed for Slide-seq, also does not account for platform effects. Testing on the Slide-seq cerebellum dataset, NMFreg assigned a minority (24.8% of n = 11,626) of pixels confidently to cell types and mislocalized broad cell type classes (Supplementary Fig. 3). Likewise, DWLS, a method designed for bulk RNA-seq deconvolution19, does not account for platform effects and performed better at within-reference cell type classification than cross-platform cell type classification (Supplementary Fig. 4).RCTD enables cross-platform detection of cell type mixturesTo address these challenges, RCTD accounts for platform effects while using an scRNA-seq reference to decompose each spatial transcriptomics pixel into a mixture of individual cell types. RCTD first calculates the mean gene expression profile of each cell type within the annotated scRNA-seq reference (Fig. 2a). Next, RCTD creates a spatial map of cell types by fitting each spatial transcriptomics pixel as a linear combination of individual cell types. RCTD takes as input RNA sequencing counts for each pixel and assumes an unknown mixture of multiple cells (Fig. 2a). Each cell type contributes an unobserved proportion of counts to each gene. RCTD estimates the proportion of each cell type for each pixel by fitting a statistical model where, for each pixel i and gene j, the observed gene counts Yi,j are assumed to be Poisson distributed. The rate parameter is determined by the pixel’s total transcript count, Ni, and λi,j, a mixture of K cell type expression profiles:$${Y}_{i,j}| {\\lambda }_{i,j} \\sim {\\rm{Poisson}}({N}_{i}{\\lambda }_{i,j})$$Fig. 2: RCTD enables cross-platform learning of cell types.a, Left, RCTD inputs. An scRNA-seq dataset, annotated by cell type, and a spatial transcriptomics dataset with unknown cell types. Middle, RCTD uses an scRNA-seq reference-based probabilistic model to predict cell types on a single pixel containing a mixture of two cell types (for example, Bergmann/Purkinje cells) with unknown cell type proportions. RCTD predicts the maximum-likelihood cell type proportions. In doublet mode, RCTD constrains each pixel to contain at most two cell types; alternatively, RCTD can estimate the best fit at a pixel using all cell types. Right, RCTD outputs a spatial map of cell types, with opacity representing the inferred cell type proportion. b, Scatter plot of measured versus predicted platform effect (by RCTD) for each gene between the single-cell and single-nucleus cerebellum datasets. The line represents the identity line. The measured platform effect is calculated as the log2 ratio of average gene expression between platforms. c, Confusion matrix for RCTD’s performance on cross-platform (trained on snRNA-seq data and tested on scRNA-seq data) cell type assignments for single cells. Color represents the proportion of the cell type on the x axis classified as the cell type on the y axis. The diagonal representing ground truth is boxed in red.Full size imageTo account for platform effects and other sources of natural variability, such as spatial variability, we assume that λi,j is a random variable defined by$$\\mathrm{log}\\,({\\lambda }_{i,j})={\\alpha }_{i}+\\mathrm{log}\\,\\left(\\mathop{\\sum }\\nolimits_{k = 1}^{K}{\\beta }_{i,k}{\\mu }_{k,j}\\right)+{\\gamma }_{j}+{\\varepsilon }_{i,j}$$where μk,j represents the mean gene expression profile for cell type k, αi is a fixed pixel-specific effect, γj is a gene-specific platform random effect and εi,j is a random effect to account for gene-specific overdispersion.We use maximum-likelihood estimation (MLE) to infer the cell type proportions, βi,k, indicating which cell types are present in each pixel (see Methods for details). RCTD may be used without constraining the number of cell types per pixel or with what we refer to as doublet mode, which searches for the best-fitting one or two cell types per pixel (see Methods for details). In particular, we refer to pixels as singlets if they contain only one cell type and doublets if they contain two cell types. Doublet mode may mitigate overfitting if mixtures of three or more cell types are expected to be rare, as we found in Slide-seq (Supplementary Fig. 5). We have also extended doublet mode to optionally fit more than two cell types per pixel (Methods).Because gene-specific platform effects are not observable from the raw data, we developed a procedure to estimate platform effects between sequencing platforms with RCTD (Methods and Supplementary Table 1). Training RCTD on the snRNA-seq cerebellum reference and testing on the scRNA-seq cerebellum dataset, we validated that our approach is able to reliably recover the platform effects (R2 = 0.90) (Fig. 2b). After normalizing cell type profiles for platform effects, RCTD achieved high cross-platform single-cell classification accuracy (89.5% of n = 3,960 cells) (Fig. 2c). Transcriptomically similar cell types, for example, oligodendrocytes/polydendrocytes, accounted for most of the remaining errors (91.8% of n = 415 errors).Because ground truth cell type identities are not known in spatial transcriptomics datasets, we benchmarked RCTD’s performance on snRNA-seq and scRNA-seq datasets with ground truth cell types obtained from previous studies20,21. To evaluate RCTD’s ability to detect and decompose mixtures in spatial transcriptomics data in the presence of platform effects, we trained RCTD on the snRNA-seq cerebellum reference (Supplementary Fig. 6) and tested on a dataset of doublets simulated as computational mixtures of single cells with known cell types in the scRNA-seq dataset (see Methods for details). By varying the true underlying cell type proportion, we observed that RCTD correctly classified singlets (89.2% ± 0.5% s.e.) and doublets (81.1% ± 0.3% s.e.) with high accuracy (Fig. 3a and Supplementary Fig. 7). A large proportion of doublet misclassifications came from transcriptionally similar cell types appearing on the same doublet pixel, which RCTD often misclassified (87.0% ± 1.2% s.e.) as singlets (Supplementary Fig. 7). Additionally, RCTD identified each cell class present on each doublet with 98.2% accuracy on confident calls (Methods; ±2.8% s.d. across 66 cell type pairs) (Fig. 3b and Supplementary Figs. 8 and 9). Finally, RCTD accurately estimated the proportion of each cell type on the sample with 12.8% r.m.s.e. (±6.9% s.d. across 66 cell type pairs) (Fig. 3c,d). These technical validations show that RCTD can accurately learn cell type information in a dataset with mixtures of single cells.Fig. 3: RCTD performs cross-platform detection and decomposition of doublets.RCTD was trained on the snRNA-seq cerebellum dataset and tested on a dataset of simulated mixtures of single cells from an scRNA-seq cerebellum dataset. a, Rate of doublet classification by RCTD on simulated mixtures of single cells with 95% confidence intervals. The x axis represents the true proportion of UMIs sampled from the minority cell type, ranging from 0% (true singlet) to 50% (equal proportion doublet) (1,980 ≤ n ≤ 3,860 simulations per condition). b, On simulated doublets of cell class 1 and cell type 2, the percentage of confident calls by RCTD that correctly identifies the cell class, where cell classes group four pairs of transcriptionally similar cell types based on a previous dendrogram20 (polydendrocytes/oligodendrocytes, molecular layer interneurons 1 and 2 (MLI1/MLI2), Bergmann cells/astrocytes and endothelial cells/fibroblasts). Column represents cell class 1, and color represents cell type 2. c, On simulated Bergmann–Purkinje doublets, the predicted Bergmann cell proportions by RCTD are shown. The x axis represents the true proportion of UMIs sampled from the Bergmann cell. The red line is the identity line, and the blue line is the average and s.d. (n = 30 simulations per condition) of RCTD’s prediction. d, For each pair of cell types, the r.m.s.e. of predicted versus true cell type proportion (as in c) by RCTD on simulated doublets (n = 390 simulations per cell type pair) is displayed. Column represents cell type 1, and color represents cell type 2.Full size imageNext, we extended our validation of RCTD on simulated data to additional contexts, including varying unique molecular identifier (UMI) counts per pixel, more than two cell types per pixel and missing cell types in the reference (Supplementary Figs. 10–13). We found that additional UMIs per pixel led to an increased confidence rate, and RCTD achieved high classification accuracy on pixels containing ≥100 UMIs (Supplementary Fig. 10). Moreover, we found that RCTD was able to accurately predict cell class proportions on pixels containing three or four cell types, a typical regime in lower-resolution spatial transcriptomics (for example, Visium; Supplementary Figs. 12 and 13). When cell types in the simulated spatial data were missing from the reference, RCTD classified pixels as the most transcriptionally similar cell type in the reference, if available (Supplementary Fig. 10). When no closest cell type was available in the reference, RCTD predicted cell types with reduced confidence rates (Supplementary Fig. 10) but often misclassified such pixels (Supplementary Fig. 11).RCTD localizes cell types in spatial transcriptomics dataWe next applied RCTD to assign and decompose cell types in spatial transcriptomics data. We first applied RCTD to localize cell types in the mouse cerebellum using an snRNA-seq reference for training and a Slide-seqV2 dataset collected on the adult mouse cerebellum as the target. RCTD confidently classified a majority (86.9% of n = 11,626) of pixels, and the resulting cell type calls are consistent with the spatial architecture of the cerebellum (Fig. 4a)22. Because ground truth cell type labels do not exist for spatial transcriptomics data, to assess the accuracy of RCTD, we used multiple validation strategies including comparison to marker genes and prior knowledge of spatial organization. While the presence of marker genes should be expected to roughly correspond to cell type presence, we do not expect a perfect relationship and consequently look for marker gene presence in conjunction with prior biological knowledge. We first considered Purkinje/Bergman cells, two cell types which are spatially colocalized in the cerebellum. We found that RCTD’s singlet pixels assigned to Purkinje or Bergmann cell types do not possess markers of the other cell type (Fig. 4b). Moreover, pixels predicted as doublets contained marker genes of both Bergmann and Purkinje cells, with estimated cell type proportion correlating with marker gene ratio (Fig. 4c). We next observed that RCTD correctly localized molecular layer interneurons to the molecular layer20, granule cells to the granular layer and oligodendrocytes to the white matter layer22, predictions further supported by the spatial correspondence between RCTD’s assignments and the marker genes of each cell type (Fig. 4d and Supplementary Fig. 14). Next, to validate RCTD’s ability to correctly localize doublets, we leveraged the layered organization of the cerebellum (Fig. 4e)22. RCTD found doublets within a layer and between adjacent layers but rarely between spatially separated layers (Fig. 4f).Fig. 4: RCTD applied to cell type learning in Slide-seq datasets.a, RCTD’s spatial map of cell type assignments in the cerebellum. Of 19 cell types, the 7 most common appear in the legend (individual cell types are displayed in Supplementary Fig. 14). b, Analogous to Fig. 1a, expression of Bergmann and Purkinje cell marker genes for RCTD’s predicted singlet pixels within a Slide-seq cerebellum dataset (colored by cell type assignment) are shown. The cell markers axis, for example, for Bergmann cells, is the sum of the expression (counts per 500) of Bergmann cell differentially expressed genes. c, Expression of Bergmann and Purkinje cell marker genes for doublet pixels predicted by RCTD colored by predicted cell type proportion. d, Predicted spatial localization of cell types by RCTD for granule cells, oligodendrocytes and MLI1. Left, summed expression (counts per 500, represented by color) of cell-type-specific marker genes. Right, predicted spatial locations of each cell type, with color representing the predicted cell type proportion. e, Top, schematic of spatial cell type organization within the cerebellum22. Bottom, connectivity graph of cell types that are likely to spatially colocalize. Cell types are colored as in a. f, Frequency of doublets identified by RCTD between each pair of cell types. Color represents log2-scale counts, and dotted boxes represent communities anatomically expected to exhibit spatial colocalization. The diagonal matrix elements represent the prevalence of singlets. Color bar range, 2 to 100 counts. All scale bars represent 250 µm.Full size imageTo test whether RCTD achieves consistent results when trained on multiple datasets, we additionally trained RCTD on the scRNA-seq cerebellum dataset and tested on Slide-seq cerebellum data (Supplementary Fig. 15). On confidently classified pixels, RCTD trained on two different references agreed on 95.7% of cell type predictions (Supplementary Fig. 16). We additionally validated RCTD’s ability to reproduce the layered structure of cortical cell types in a Slide-seqV2 dataset of the mouse somatosensory cortex, training on a Smart-seq2 reference (Methods) (Supplementary Figs. 17 and 18)1,23. We found that cortical neuron subtypes appeared in appropriate layers, with L2/3 intratelencephalic (IT), followed by L4, followed by L5 IT and the L5 pyramidal tract (PT), followed by L6 corticothalamic (CT) and L6 IT, followed by L6b, consistent with the results of additional studies24.RCTD discovers spatial localization of cellular subtypesNext, we tested the ability of RCTD to profile the spatial localization of cellular subtypes as recently defined by large-scale transcriptomic analyses21, for which there is limited knowledge of spatial position in their resident tissues. To this end, we validated RCTD’s ability to classify previously defined21 subtypes of interneurons in the hippocampus (Methods). We first used RCTD to spatially annotate cell types in Slide-seq data of the mouse hippocampus (Fig. 5a), training on an scRNA-seq hippocampus dataset 21. We found that RCTD correctly localized hippocampal cell types (Supplementary Figs. 19 and 20). We also validated RCTD’s ability to localize hippocampal cell types in a Visium spatial transcriptomics dataset (Supplementary Figs. 20 and 21)2 and found qualitative agreement between predicted cell type localization patterns on Slide-seq and Visium (Supplementary Fig. 22). We then observed spatial clustering of pixels assigned to the broad class of interneurons (Fig. 5b), which we inferred to be derived from large single interneuron cells4, an inference supported by histological examination25 (Supplementary Fig. 23). Consequently, we tested RCTD’s performance in assigning pixels within a cluster to the same interneuron subclass and found high agreement (97.1% ± 0.09% s.e.) of coarse subclass classification between confident pixels within the same spatial cluster (Fig. 5c and Methods). Additionally, we found that the spatial localization of the basket/OLM subclass coincided with the expression of Sst, a differentially expressed gene for this subclass (Fig. 5d). Finally, we used RCTD to assign each spatial cluster to 1 of 27 transcriptomically defined interneuron subtypes, confidently classifying the majority of interneuron pixels (Fig. 5e and Supplementary Fig. 24). Localizations of known subtypes, such as CA1 lacunosum, which appears in the stratum lacunosum-moleculare (SLM) layer of the CA1 (ref. 26), and OLM, which appears primarily in the stratum oriens (SO)27, agree with known anatomy. We conclude that RCTD enables the identification of spatial locations of cellular subtypes in spatial transcriptomics data.Fig. 5: RCTD maps cell types and subtypes in Slide-seq hippocampus data.a, RCTD’s spatial map of predicted cell types in the hippocampus. Of 17 cell types, the 8 most common appear in the legend (individual cell types are displayed in Supplementary Fig. 19). b, Predicted spatial localization of interneuron cell types by RCTD. Left, normalized expression of marker genes (represented by color, counts per 500). Right, predicted spatial locations of interneurons, with color representing predicted cell type proportion. c, Predicted confident assignments of interneuron pixels by RCTD to three classes of interneuron subtypes plotted in space. Color indicates the predicted subclass. d, Expression (counts per 500) of the Sst gene in interneurons identified by RCTD. e, RCTD’s confident assignment of spatial clusters to 27 interneuron subtypes (25/27 subtypes assigned). All scale bars represent 250 µm. Gray circles represent the locations of CA1, CA3 and dentate gyrus excitatory neurons for reference. CGE, caudal ganglionic eminence; OLM, oriens–lacunosum moleculare.Full size imageRCTD enables detection of spatially variable genes within cell typePrevious computational methods search for spatially variable genes without incorporating cell type information6,7,8. However, because cell types are not evenly distributed in space and different cell types have different expression profiles, this approach will likely lead to confusing cell type marker genes with spatially variable genes. For example, we found that the 20 genes with the highest spatial autocorrelation in the Slide-seq hippocampus data (Methods) were primarily expressed in only a few cell types, indicating that their spatial variation is partially driven by cell type composition (Fig. 6a). After conditioning on cell type, a majority of these genes exhibited small remaining spatial variation (Fig. 6b). For example, Ptk2b was differentially expressed in excitatory neurons but did not exhibit any spatial variation that was unexplained by cell type alone (Fig. 6c).Fig. 6: RCTD enables the detection of cell-type-specific spatial patterns of gene expression.a, Box plot of the coefficient of variation (CV) of genes across cell types in the hippocampus scRNA-seq reference. Spatially variable genes were selected for large spatial autocorrelation in the Slide-seq hippocampus data without considering cell type. For reference, 50 randomly selected genes are shown. b–g, Analysis of Slide-seq hippocampus data. b, Box plot of the CV in gene expression within CA3 cells identified by RCTD. Left, spatially variable genes selected for large spatial autocorrelation in the hippocampus without considering cell type. Right, using RCTD’s expected cell-type-specific gene expression, genes determined to be spatially variable by applying local regression within the CA3 cell type are shown (P ≤ 0.01, permutation F-test). c, Bold pixels represent the expression of Ptk2b, a gene selected to be spatially variable without considering cell type. Blue represents pixels with excitatory neurons (as detected by RCTD), whereas red represents pixels without excitatory neurons. d, Smoothed spatial expression patterns (counts per 500), recovered by local regression, of two genes detected to have large spatial variation within RCTD’s CA3 cells. Individual pixels expressing the gene are colored in black. e, Spatial localization of astrocyte doublets in the hippocampus detected by RCTD. Color represents the other cell type on the doublet. f, Mean and standard error of RCTD’s expected gene expression (counts per 500) within groups of astrocytes (129 ≤ n ≤ 956 cells per condition) classified by their cellular environment (color). Scale is on the right for Pantr1; scale is on the left for other genes. g, Spatial visualization of genes with environment-dependent expression within astrocytes. Red represents the astrocytes surrounded by other astrocytes, whereas blue represents astrocytes that are surrounded by excitatory neurons (left) or dentate gyrus cells (right). Bold points represent astrocytes expressing Slc6a11 (left) or Entpd2 (right). All scale bars represent 250 µm. For box plots, the median, 25th and 75th percentiles define the box, with whiskers extending the hinge by 1.5 × the interquartile range. Endo_Tip, endothelial tip cells; Endo_Stalk, endothelial stalk cells.Full size imageInstead, RCTD enables the estimation of spatial gene expression patterns within each cell type. After identifying cell types, we used RCTD to compute the expected cell-type-specific gene expression for each cell type within each pixel (see Methods for details). Using this cell-type-specific expected gene expression, we detected genes with large spatial variation within CA3 pyramidal neurons (Fig. 6b and Supplementary Table 2; P ≤ 0.01, permutation F-test). For these genes, we recovered smooth patterns of gene expression over space with locally weighted regression (Fig. 6d; see Methods for details). In addition to spatially variable genes, RCTD can be used to detect the effect of the cellular environment on gene expression. In the hippocampus, RCTD detected astrocyte doublets with many cell types in distinct spatial regions (Fig. 6e); we hypothesized that astrocytic transcriptomes could vary based on their cellular environment. We detected genes whose expression within astrocytes depended on colocalization with another cell type (Fig. 6f,g, Methods and Supplementary Table 2). For instance, we found that Entpd2 was enriched in astrocytes colocalizing with dentate neurons (P = 0.025, two-tailed z-test). This is consistent with a prior study that detected a population of astrocyte-like progenitor cells in the dentate expressing Entpd2 (ref. 28). Moreover, Slc6a11, which enables uptake of the GABA neurotransmitter and likely modulates inhibitory synapses29, was differentially expressed in astrocytes around excitatory neurons (P < 10−6, two-tailed z-test)30. Thus, RCTD enables measurement of the effect of the cellular environment and space on gene expression.DiscussionAccurate spatial mapping of cell types and detection of cell-type-specific spatial patterns of gene expression is critical for understanding tissue organization and function. Here, we introduce RCTD, a computational method for the accurate decomposition of spatial transcriptomic pixels into mixtures of cell types using an scRNA-seq reference normalized for platform effects. RCTD takes as input RNA sequencing counts at each pixel containing an unknown mixture of multiple cells and predicts the proportion of each cell type on each pixel. RCTD accurately maps cell types, as demonstrated on a dataset of simulated doublets as well as cerebellum and hippocampus spatial transcriptomics datasets. We additionally demonstrated RCTD’s ability to correctly localize subtypes in a Visium hippocampus spatial transcriptomics dataset, showing that RCTD can be applied broadly to different platforms. We further showed that RCTD can spatially localize transcriptomically defined cellular subtypes of interneurons of the hippocampus. Lastly, we demonstrated that RCTD enables the discovery of spatially varying gene expression within cell types in the hippocampus.As the cost of sequencing decreases, scRNA-seq datasets are becoming more prevalent and easier to generate31. Individual scRNA-seq methods can be more or less similar to a spatial transcriptomics dataset in their platform effects, which can be measured by RCTD. For example, relative to Slide-seq, we found a lower magnitude of platform effects for the single-cell hippocampus reference than for the single-nucleus cerebellum reference. While spatial platform effects are hard to measure a priori, we have demonstrated our platform effect normalization procedure to be robust to the choice of reference (scRNA-seq, snRNA-seq, Smart-seq). We thus anticipate that RCTD should be compatible with future scRNA-seq modalities. Furthermore, our method is flexible to the choice of target platform. For example, our procedure for estimating platform effects depends only on merging all pixels into one pseudo-bulk measurement. Our method can consequently be applied to estimate platform effects from an scRNA-seq reference to any other sequencing technology, including bulk RNA sequencing, providing a generally applicable normalization procedure for RNA sequencing. Although motivated by spatial transcriptomics, we expect that RCTD can learn cell types on other non-spatial datasets with single cells or mixtures of multiple cell types32.A limitation of RCTD is that it relies on an assumption that platform effects are shared among cell types. This is a general problem with reference-based cell type learning, and it will be important to explore learning cell-type-specific platform effects in future work. We additionally found that a challenging problem for RCTD is cell types missing from the reference but present in the spatial data. This issue may be mitigated by cropping the spatial data to exclude regions known a priori to primarily contain cell types not present in the reference. Future work includes improving our method to identify pixels with cell types out of reference.When fine spatial resolution causes the localization of three or more cell types to one pixel to be uncommon (for example, Slide-seq11), we recommend using doublet mode of RCTD, which constrains at most two cell types per pixel. Otherwise, RCTD can be used to decompose any number of cell types per pixel (for example, Visium). Similar in principle to Akaike information criterion (AIC) model selection methods33, doublet mode reduces overfitting by penalizing the number of cell types used, improving RCTD’s statistical power. This concept can be readily extended to triplets and beyond in future work.A major goal of spatial transcriptomics is understanding the contributions of cell type and cellular environment to cell state. RCTD facilitates the discovery of these effects by computing expected cell-type-specific gene expression for each spatial transcriptomics pixel. For instance, we analyzed gene expression within astrocytes to detect astrocytic genes influenced by the local cellular environment. There are many drivers of a gene’s dependence on cellular environment, including cell-to-cell interactions, regional signaling factors or cellular history during development. The ability of RCTD to localize cell types uniquely enables the high-throughput generation of biologically relevant hypotheses concerning the effects of space and environment on gene expression. As more spatial transcriptomics datasets are generated, we expect that RCTD will facilitate the discovery of new principles of cellular organization in biological tissue.MethodsStatistical modelHere, we describe the statistical model used to perform RCTD to identify mixtures of cell types. For each pixel i = 1, …, I in the spatial transcriptomics dataset, we denote the observed gene expression counts as Yi,j for each gene j = 1, …, J. We model these counts with the following hierarchical model:$$\\begin{array}{ll}{Y}_{i,j}| {\\lambda }_{i,j} &\\sim {\\rm{Poisson}}({N}_{i}{\\lambda }_{i,j})\\\\ \\mathrm{log}\\,({\\lambda }_{i,j})&={\\alpha }_{i}+\\mathrm{log}\\,\\left(\\mathop{\\sum }\\nolimits_{k = {\\textrm{1}}}^{K}{\\beta }_{i,k}{\\mu }_{k,j}\\right)+{\\gamma }_{j}+{\\varepsilon }_{i,j}\\end{array}$$\n                    (1)\n                where Ni represents the total transcript count or number of UMIs for pixel i, K represents the number of cell types present in our dataset, αi represents a fixed pixel-specific effect, μk,j represents the mean gene expression profile for cell type k and gene j, βi,k represents the proportion of the contribution of cell type k to pixel i, γj represents a gene-specific platform random effect and εi,j represents a random effect to account for other sources of variation, such as spatial effects. By modeling Poisson noise, RCTD can account for sampling noise, including when overall UMI counts are low (≈100−1,000), such as in Slide-seq. Data exploration (Fig. 1f) supported a Poisson–lognormal mixture used previously for count data34. Thus, we assume γj and εi,j both follow normal distributions with mean 0 and s.d. of σγ and σε, respectively. We note that, in practice, we additionally modify the random effects distributions to include a heavier tail that is robust to outliers (using an approximation to a Cauchy–Gaussian mixture distribution35; see Supplementary Methods). The main goal of our analysis is to estimate the βi,k values, which represent the cell type or cell types present in each pixel i, constrained so that \\(\\mathop{\\sum }\\nolimits_{k = {\\textrm{1}}}^{K}{\\beta }_{i,k}=1\\) and each βi,k ≥ 0.Fitting the modelModel (1) is a complex model with thousands of parameters (many, K × J, of these parameters are introduced by cell-type-specific gene expression profiles). We overcome this challenge by fitting our model using a stepwise approach that includes a supervised learning step for estimating these expression profiles, μk,j. The steps of our estimation approach are as follows:\n\n1.\nSupervised estimation of cell type profiles. We use a reference dataset, referred to as the training dataset, to obtain estimates for the mean gene expression profiles μk,j. We refer to these estimates as \\({\\hat{\\mu }}_{k,j}\\), which are then considered fixed in the next steps.\n\n\n2.\nGene filtering. We use the estimated cell type profiles \\({\\hat{\\mu }}_{k,j}\\) to filter out genes that are unlikely to be informative. We do this by selecting genes that show differential expression across cell types.\n\n\n3.\nPlatform effect normalization. The random effects γj account for the unwanted technical variation resulting from gene expression profiles varying across different sequencing platforms. The next step is therefore to estimate σγ and predict γj for each gene j. We denote the prediction of the random effects as \\({\\hat{\\gamma }}_{j}\\), which are then considered fixed in the next step.\n\n\n4.\nRCTD. We use the plugin estimates \\({\\hat{\\mu }}_{k,j}\\) and \\({\\hat{\\gamma }}_{j}\\) and assume that they are fixed. Conditional on these estimates, for each sample i and treating εi,j as a random effect, we can compute the MLE for βi,k, αi and σε.\n\nNext, we describe each of these steps in detail.Supervised estimation of cell type profilesFirst, we obtain an scRNA-seq reference, which has been previously annotated with cell types. We estimate \\({\\hat{\\mu }}_{k,j}\\) as the average normalized expression of gene j within all cells of cell type k.Gene filteringUsing the estimated cell type expression profiles \\({\\hat{\\mu }}_{k,j}\\), we select differentially expressed genes that will be informative when estimating cell type proportions. For each cell type in the scRNA-seq reference, we select genes with a minimum average expression above 0.0625 counts per 500 and at least 0.5 log fold change compared to average expression across all cell types. Typically, this results in about 5,000 genes for the platform effect normalization step. These parameters are further increased for the RCTD step to reduce the set to about 3,000 genes for computational efficiency.Platform effect normalizationEstimating the βi,k in the presence of the unobserved platform effects γj is challenging. However, γj can be reliably predicted independently from the other parameters by summarizing the spatial transcriptomics data as a single pseudo-bulk measurement \\({S}_{j}\\equiv \\mathop{\\sum }\\nolimits_{i = 1}^{I}{Y}_{i,j}\\). Notice that, conditioned on the rates λi,j, Sj is Poisson distributed with the average \\({\\bar{Y}}_{j}=\\frac{1}{I}{S}_{j}\\) having expectation$$\\begin{array}{ll}{\\mathrm{log}}\\,\\{{\\mathbb{E}}({\\bar{Y}}_{j}| {\\lambda }_{1,j},\\ldots ,{\\lambda }_{I,j})\\}&={\\mathrm{log}}\\,\\left(\\frac{1}{I}\\mathop{\\sum }\\nolimits_{i = 1}^{I}{N}_{i}{\\lambda }_{i,j}\\right)\\\\ &={\\gamma }_{j}+{\\mathrm{log}}\\,\\left(\\bar{N}\\mathop{\\sum }\\nolimits_{k = 1}^{K}{\\mu }_{k,j}{B}_{k,j}\\right)\\\\ &\\approx {\\gamma }_{j}+{\\mathrm{log}}\\,\\left(\\bar{N}\\mathop{\\sum }\\nolimits_{k = 1}^{K}{\\mu }_{k,j}{\\beta }_{k}\\right)+{\\mathrm{log}}\\,({\\beta }_{0})\\end{array}$$with$$\\begin{array}{l}{\\beta }_{0}\\ {\\mathrm{a}}\\ {\\mathrm{scaling}}\\ {\\mathrm{factor}}\\ {\\mathrm{constant}},\\ {\\bar{N}}={\\frac{1}{I}}\\mathop{\\sum }\\nolimits_{i = 1}^{I}{N}_{i},\\ {\\mathrm{and}}\\\\ {B}_{k,j}={\\frac{1}{I}}\\mathop{\\sum }\\nolimits_{i = 1}^{I}\\frac{{N}_{i}}{\\bar{N}}{\\beta }_{k,i}{\\mathrm{exp}} ({\\alpha }_{i}+{\\varepsilon }_{i,j})\\end{array}$$as a random variable that is approximately proportional to \\({\\beta }_{k}=\\frac{1}{I}\\mathop{\\sum }\\nolimits_{i = 1}^{I}\\frac{{N}_{i}}{\\bar{N}}{\\beta }_{i,k}{\\alpha }_{i}\\), the proportion of cell type k in our target dataset:$${B}_{k,j}\\approx {\\beta }_{k}{\\beta }_{0}$$This follows from the fact that \\({\\mathbb{E}}({B}_{k,j})={\\beta }_{k}{\\beta }_{0}\\) and Var(Bk,j) converges to 0 when I is large (see Supplementary Methods for details). By plugging in the \\({\\hat{\\mu }}_{i,j}\\) obtained in the first step and treating them as known, we can then obtain the MLE for β0, the βk values and σγ and subsequently estimate the platform effects γj as \\({\\hat{\\gamma }}_{j}\\).RCTDWith \\({\\hat{\\mu }}_{k,j}\\) and \\({\\hat{\\gamma }}_{j}\\) in place, we plug them into equation (1), which we can rewrite as$${Y}_{i,j}| {\\varepsilon }_{i,j} \\sim {\\rm{Poisson}}\\left\\{{N}_{i}\\exp \\left[{\\alpha }_{i}+{\\mathrm{log}}\\,\\left(\\mathop{\\sum }\\nolimits_{k = 1}^{K}{\\beta }_{i,k}{\\hat{\\mu }}_{k,j}\\right)+{\\hat{\\gamma }}_{j}+{\\varepsilon }_{i,j}\\right]\\right\\}$$\n                    (2)\n                $${\\varepsilon }_{i,j} \\sim {\\rm{Normal}}(0,{\\sigma }_{\\varepsilon }^{2})$$\n                    (3)\n                and we obtain the MLE αi, βi,k and σε. The algorithm implemented to find the MLE is in the Supplementary Methods, and we have validated its ability to find the MLE (Supplementary Fig. 25).Cell type identification by model selectionNotice that in the procedure described above, \\({\\hat{\\beta }}_{i,k}>0\\) for as many as K cell types, implying that pixel i is a mixture of several cell types. However, for many spatial transcriptomics technologies, we do not expect more than two cell types per pixel. We therefore implemented a version of our model and estimation procedure that constrains the number of \\(k\\) values for which βi,k > 0. We refer to this version of the method as doublet mode. In doublet mode, cell type identification is accomplished using a model selection framework where we compare likelihoods and penalize the inclusion of additional features. In this version of our method, we refer to the two possible outcomes as singlet and doublet. The maximum number of cell types per pixel can be optionally increased (for example, to three or four; Supplementary Methods), or RCTD can be run without constraining the number of cell types per pixel.Specifically, for each cell type k, we compute \\({\\mathcal{L}}(k)\\) as the log likelihood of the model fit with only cell type k and \\({\\mathcal{L}}(k,\\ell )\\) as the log likelihood of the model fit with only cell types k and ℓ. For each pixel i, we then define the following:$${\\hat{k}}=\\,{\\text{argmax}}_{k}\\ {\\mathcal{L}}(k)\\,{\\text{and}}\\,\\hat{\\ell }=\\,{\\text{argmax}}_{\\ell\\ne \\hat{k}}\\ {\\mathcal{L}}({\\hat{k}},\\ell )$$Because we expect many pixels to represent only one cell type, we then used a penalized approach similar to AIC33 to decide between the two models, using only one cell \\(\\hat{k}\\) or two cells \\(\\hat{k},\\hat{\\ell }\\). Specifically, we select the model \\({\\mathcal{M}}\\) maximizing$${\\rm{AIC}}({\\mathcal{M}})\\equiv {\\mathcal{L(M)}}-Vp({\\mathcal{M}})$$where p represents the number of parameters (cell types) and V represents a penalty weight. In the results presented here, we selected V = 25 based on simulation studies.We then use an ad hoc approach to classify our selections into either confident or unconfident in the following way:\n\n1.\nConsider pairs of cell types (k, ℓ) such that \\(| {\\mathcal{L}}(\\hat{k},\\hat{\\ell })-{\\mathcal{L}}(k,\\ell )| <\\delta\\). If there exists one such pair such that \\(\\hat{k}\\notin \\{k,\\ell \\}\\) and another (possibly identical) pair where \\(\\hat{\\ell }\\notin \\{k,\\ell \\}\\), then we assume that we do not have enough information to predict cell types and call this pixel unconfident. If this condition does not hold, then we will be confident of at least one cell type, \\(\\hat{k}\\) and/or \\(\\hat{\\ell }\\), that appears in all such pairs.\n\n\n2.\nIf condition 1 does not hold and we select the singlet model, then we call this a confident singlet.\n\n\n3.\nIf condition 1 does not hold and we select the doublet model, then if there exists a cell type pair {k, ℓ} distinct from \\(\\{\\hat{k},\\hat{\\ell }\\}\\) for which \\(| {\\mathcal{L}}(\\hat{k},\\hat{\\ell })-{\\mathcal{L}}(k,\\ell )| <\\delta\\), we call this an unconfident doublet; otherwise, we call this a confident doublet.\n\nFor the work in this paper, we set δ = 10 based on simulation studies. Although this value of δ was used for RCTD’s accurate results across all datasets in this study, users can decide to increase δ from the default, which will reduce the number of confident pixels and potentially achieve more accurate results on fewer confident pixels.Classification of cellular subtypesWe apply the RCTD procedure described above to detect major cell types. But, as mentioned in the results section, recently characterized cellular subtypes have been identified and defined by large-scale transcriptomic analyses21. After selecting pixels in which RCTD was confident of the presence of the cell type of interest, we reran RCTD on these pixels using a larger set of cellular subtype profiles defined by the reference. During the subtype step of RCTD, we constrained the broad cell type classes appearing on each pixel so that they were the same as originally detected by RCTD.For interneurons, we used 27 previously defined21 interneuron subtypes and hierarchically clustered the log average expression vectors of these subtypes into three major subclasses (Supplementary Fig. 26). To define spatial clusters of Slide-seq interneurons, we hierarchically clustered the points in space and manually split doublets. To classify a set of pixels presumed to comprise the same cell, we selected the subtype maximizing the joint density of these pixels by summing the log likelihoods.Expected cell-type-specific gene expressionOnce β has been estimated by RCTD, we can compute the expected cell-type-specific gene expression at each pixel. Specifically, we compute the conditional expectation of Yi,k,j, the expression of gene j on pixel i from cell type k (see Supplementary Methods for derivation):$${\\mathbb{E}}[{Y}_{i,k,j}| \\beta ,{Y}_{i,j}]=\\frac{{Y}_{i,j}{\\beta }_{k,i}{\\hat{\\mu }}_{k,j}}{\\mathop{\\sum }\\nolimits_{k^{\\prime} = 1}^{K}{\\beta }_{k^{\\prime} ,i}{\\hat{\\mu }}_{k^{\\prime} ,j}}$$\n                    (4)\n                Intuitively, the expected expression of a cell type is proportional to the proportion of the cell type on the pixel and the probability of observing the gene in each cell type. We note that we are only computing the conditional expectation \\({\\mathbb{E}}[{Y}_{i,k,j}| \\beta ,{Y}_{i,j}]\\), but Yi,k,j ∣ β, Yi,j may have large variance for a single pixel due to sampling noise. Furthermore, this estimate is based on a strong assumption of the model that random effects of gene expression εi,j are shared across cell types.Collection and processing of scRNA-seq and spatial transcriptomics dataWe used publicly available scRNA-seq datasets, which have previously been annotated by cell type using clustering. While clustering itself is an imperfect annotation of cellular identity, for the purposes of our study we assumed that these annotations were sufficiently accurate. For running RCTD on cerebellum, we trained on an snRNA-seq dataset20. For training RCTD on the hippocampus and testing (cross-platform) RCTD on the cerebellum, we used the DropViz scRNA-seq dataset21. This single-cell cerebellum dataset was also used as training data to predict on Slide-seq cerebellum (Supplementary Fig. 15). The DropViz hippocampus dataset also contained annotations for interneuron subtypes. Before training RCTD on Smart-seq2 (to predict on Slide-seq somatosensory cortex), we normalized read counts by gene length following the approach of transcripts per million (TPM). For marker gene plots, we defined a metagene for each cell type as the sum of genes that were overexpressed with a log(fold change) above 3. In Supplementary Fig. 3 concerning the Slide-seq cerebellum data, for the cell type MLI2, the log(fold change) threshold was increased to 4 to achieve additional specificity.Slide-seq mouse cerebellum and somatosensory cortex data were collected using the Slide-seqV2 protocol that was developed and described recently (see Supplementary Methods for details)1. Slide-seqV2 hippocampus and Visium hippocampus data were used from previous studies1,2. Data preprocessing was done using the Slide-seq tools pipeline1. The region of interest (ROI) was cropped before running RCTD, and spatial transcriptomic spots were filtered to have a minimum of 100 UMIs. We used prior anatomical knowledge to crop the ROI from an image of the total UMI counts per pixel across space, which in many cases allows one to observe overall anatomical features. For example, in Slide-seq hippocampus, the somatosensory cortex was cropped out before analysis. In Slide-seq cerebellum, the granule cell region was defined as pixels that were within 40 µm of at least 6 pixels expressing granule cell markers at the level of 5 counts per 500.Validation with simulated doublets datasetWe trained RCTD on the cerebellum snRNA-seq reference and tested the model on a dataset of doublets simulated from the scRNA-seq cerebellum dataset. We restricted to 12 cell types that appeared in both the single-nucleus and single-cell references. To simulate a doublet, we randomly chose a cell from each cell type and sampled a predefined number of UMIs from each cell (total 1,000). To assess the performance of RCTD on predicting more than one or two cell types, we developed simulated spatial transcriptomics datasets with either three or four cell types per pixel. Cell type proportions per pixel were determined by choosing three or four cell types at random and drawing the true cell type proportion from the uniform distribution. To model the conditions of Visium, we sampled 10,000 UMIs per pixel. If a single cell did not have enough UMIs for its cell type, we continued augmenting the pixel with additional cells from that cell type.We defined a doublet as containing 25–75% of UMIs for each of the two cell types, whereas a singlet contained 0% or 100%. We defined the doublet classification rate (Fig. 3a) as the ratio of the number of predicted doublets to the total number of predicted singlets or doublets. Cell type proportion estimation (Fig. 3b,c) was measured with RCTD fit using the two cell types present on the simulated doublet. We defined coarser classes of cell types (used, for example, in Fig. 3d) based on a previously defined dendrogram20. This resulted in the pairing of MLI1–MLI2, astrocytes–Bergmann cells, oligodendrocytes–polydendrocytes and endothelial cells–fibroblasts. The cell class identification rate (Fig. 3d, top) was calculated on the subset of confidently called cell types.Detection of cell-type-specific gene expression patternsAfter computing expected cell-type-specific gene expression, we detected spatially variable genes within a cell type. Genes were filtered for minimum average expression within the scRNA-seq reference of the cell type of interest (0.01 counts per 500 and at least 50% of the average expression of other cell types). We applied 2D local regression to these genes and calculated the CV of the estimated smooth function. We selected genes with CV ≥ 0.5 and tested the local regression variation with a permutation F-test (P ≤ 0.01, 99 permutations of spatial locations).Next, we searched for genes that changed in expression within astrocytes based on colocalization with another cell type. We classified astrocytes as colocalizing with another particular cell type if at least 25% of their neighbors within a 40-µm radius were that cell type. If at least 80% of these neighbors were other astrocytes, the cell was classified as colocalizing with other astrocytes. We filtered for genes in the scRNA-seq reference with minimum average expression within astrocytes (0.01 counts per 500 and log(fold change) of ≥1.6 versus each other cell type). We looked for genes that were differentially expressed depending on the colocalized cell type, testing with a two-tailed z-test (P < 0.05). We pooled together excitatory neuron cell types, defined as CA1, CA3 and dentate cell types, for the analysis of several genes, including Kcnj16, Slc7a10 and Slc6a11, that were differentially expressed in astrocytes localized around each of the CA1, CA3 and dentate cell types.Implementation detailsRCTD is publicly available as an R package (https://github.com/dmcable/RCTD). The quadratic program that arises in the RCTD optimization algorithm is solved using the quadprog package in R36. We used and modified code from the DWLS package to implement sequential quadratic programming for RCTD19,37. Non-negative least-squares regression was also implemented as a quadratic program. Unsupervised clustering was performed using the Seurat package, following Seurat’s spatial transcriptomics vignette38. Clusters were assigned by their expression of marker genes and spatial localization. Additionally, detection of globally spatially variable genes was accomplished using Seurat’s implementation of Moran’s I. Local regression was accomplished with the loess function. The NMFreg Python notebook was used with default parameters (factors = 30) for testing NMFreg. To test DWLS on cell type classification, we used the buildSignatureMatrixUsingSeurat function to build the cell type signature matrix and used the solveDampenedWLS function to predict cell type proportions for each pixel, which were scaled to units of UMI counts. RCTD was tested on a Macintosh laptop computer with a 2.4 GHz Intel Core i9 processor, 8 cores and 32 GB of memory. We recommend at least 4 GB of memory to run RCTD. For example, we timed RCTD on the Slide-seq cerebellum dataset, containing 11,626 pixels, 19 cell types and 3,272 differentially expressed genes detected by RCTD. Under these conditions, RCTD ran in 14 min and 57 s.Reporting SummaryFurther information on research design is available in the Nature Research Reporting Summary linked to this article.\n\n\nData availability\nSlide-seqV2 data generated for this study are available at the Broad Institute Single Cell Portal at https://singlecell.broadinstitute.org/single_cell/study/SCP948. Additional publicly available data from other studies that were used for analysis are also included in this repository.\nCode availability\nRCTD is implemented in the open-source R package RCTD, with source code freely available at https://github.com/dmcable/RCTD. Additional code used for analysis in this paper is available at https://github.com/dmcable/RCTD/tree/dev/AnalysisPaper.\nReferencesStickels, R. R. et al. Sensitive spatial genome wide expression profiling at cellular resolution. Nature Biotechnology (in the press).10x Genomics. 10x Genomics: Visium spatial gene expression (2020).Vickovic, S. et al. High-definition spatial transcriptomics for in situ tissue profiling. Nat. Methods 16, 987–990 (2019).Article \n    CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar \n                Pelkey, K. A. et al. Hippocampal GABAergic inhibitory interneurons. Physiol. Rev. 97, 1619–1747 (2017).Article \n    CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar \n                Cembrowski, M. S. et al. The subiculum is a patchwork of discrete subregions. elife 7, e37701 (2018).Article \n    PubMed \n    PubMed Central \n    \n                    Google Scholar \n                Edsgärd, D., Johnsson, P. & Sandberg, R. Identification of spatial expression trends in single-cell gene expression data. Nat. Methods 15, 339–342 (2018).Article \n    PubMed \n    PubMed Central \n    \n                    Google Scholar \n                Sun, S., Zhu, J. & Zhou, X. Statistical analysis of spatial expression patterns for spatially resolved transcriptomic studies. Nat. Methods 17, 193–200 (2020).Article \n    CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar \n                Svensson, V., Teichmann, S. A. & Stegle, O. SpatialDE: identification of spatially variable genes. Nat. Methods 15, 343–346 (2018).Article \n    CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar \n                Wagner, A., Regev, A. & Yosef, N. Revealing the vectors of cellular identity with single-cell genomics. Nat. Biotechnol. 34, 1145–1160 (2016).Article \n    PubMed \n    PubMed Central \n    \n                    Google Scholar \n                Regev, A. et al. Science forum: the Human Cell Atlas. eLife 6, e27041 (2017).Article \n    PubMed \n    PubMed Central \n    \n                    Google Scholar \n                Rodriques, S. G. et al. Slide-seq: a scalable technology for measuring genome-wide expression at high spatial resolution. Science 363, 1463–1467 (2019).Article \n    CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar \n                Stuart, T. et al. Comprehensive integration of single-cell data. Cell 177, 1888–1902 (2019).Article \n    CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar \n                Moncada, R. et al. Integrating microarray-based spatial transcriptomics and single-cell RNA-seq reveals tissue architecture in pancreatic ductal adenocarcinomas. Nat. Biotechnol. 38, 333–342 (2020).Article \n    CAS \n    PubMed \n    \n                    Google Scholar \n                Townes, F. W., Hicks, S. C., Aryee, M. J. & Irizarry, R. A. Feature selection and dimension reduction for single-cell RNA-seq based on a multinomial model. Genome Biol. 20, 295 (2019).Article \n    CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar \n                Hafemeister, C. & Satija, R. Normalization and variance stabilization of single-cell RNA-seq data using regularized negative binomial regression. Genome Biol. 20, 296 (2019).Article \n    CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar \n                Pliner, H. A., Shendure, J. & Trapnell, C. Supervised classification enables rapid annotation of cell atlases. Nat. Methods 16, 983–986 (2019).Article \n    CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar \n                Leek, J. T. et al. Tackling the widespread and critical impact of batch effects in high-throughput data. Nat. Rev. Genet. 11, 733–739 (2010).Article \n    CAS \n    PubMed \n    \n                    Google Scholar \n                Bakken, T. E. et al. Single-nucleus and single-cell transcriptomes compared in matched cortical cell types. PLoS ONE 13, e0209648 (2018).Tsoucas, D. et al. Accurate estimation of cell-type composition from gene expression data. Nat. Commun. 10, 2975 (2019).Article \n    PubMed \n    PubMed Central \n    \n                    Google Scholar \n                Kozareva, V. et al. A transcriptomic atlas of the mouse cerebellum reveals regional specializations and novel cell types. Preprint at bioRxiv https://doi.org/10.1101/2020.03.04.976407 (2020).Saunders, A. et al. Molecular diversity and specializations among the cells of the adult mouse brain. Cell 174, 1015–1030 (2018).Article \n    CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar \n                Brown, A. M. et al. Molecular layer interneurons shape the spike activity of cerebellar Purkinje cells. Sci. Rep. 9, 1742 (2019).Article \n    PubMed \n    PubMed Central \n    \n                    Google Scholar \n                Tasic, B. et al. Adult mouse cortical cell taxonomy revealed by single cell transcriptomics. Nat. Neurosci. 19, 335–346 (2016).Article \n    CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar \n                Zhang, M. et al. Molecular, spatial and projection diversity of neurons in primary motor cortex revealed by in situ single-cell transcriptomics. Preprint at bioRxiv https://doi.org/10.1101/2020.06.04.105700 (2020).Sunkin, S. M. et al. Allen Brain Atlas: an integrated spatio-temporal portal for exploring the central nervous system. Nucleic Acids Res. 41, D996–D1008 (2012).Article \n    PubMed \n    PubMed Central \n    \n                    Google Scholar \n                Capogna, M. Neurogliaform cells and other interneurons of stratum lacunosum-moleculare gate entorhinal–hippocampal dialogue. J. Physiol. 589, 1875–1883 (2011).Article \n    CAS \n    PubMed \n    \n                    Google Scholar \n                Leão, R. N. et al. OLM interneurons differentially modulate CA3 and entorhinal inputs to hippocampal CA1 neurons. Nat. Neurosci. 15, 1524–1530 (2012).Article \n    PubMed Central \n    \n                    Google Scholar \n                Gampe, K. et al. NTPDase2 and purinergic signaling control progenitor cell proliferation in neurogenic niches of the adult mouse brain. Stem Cells 33, 253–264 (2015).Article \n    CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar \n                Dikow, N. et al. 3p25.3 microdeletion of GABA transporters SLC6A1 and SLC6A11 results in intellectual disability, epilepsy and stereotypic behavior. Am. J. Med. Genet. A 164, 3061–3068 (2014).Article \n    CAS \n    \n                    Google Scholar \n                Lee, T.-S. et al. GAT1 and GAT3 expression are differently localized in the human epileptogenic hippocampus. Acta Neuropathol. 111, 351–363 (2006).Article \n    CAS \n    PubMed \n    \n                    Google Scholar \n                Kulkarni, A., Anderson, A. G., Merullo, D. P. & Konopka, G. Beyond bulk: a review of single cell transcriptomics methodologies and applications. Curr. Opin. Biotechnol. 58, 129–136 (2019).Article \n    CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar \n                Halpern, K. B. et al. Paired-cell sequencing enables spatial gene expression mapping of liver endothelial cells. Nat. Biotechnol. 36, 962–970 (2018).Article \n    CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar \n                Sakamoto, Y., Ishiguro, M. & Kitagawa, G. Akaike Information Criterion Statistics 1st edn, Vol. 1 (Springer Netherlands, 1986).Zhou, M., Li, L., Dunson, D. & Carin, L. Lognormal and gamma mixed negative binomial regression. Proc. Int. Conf. Mach. Learn. 2012, 1343–1350 (2012).PubMed \n    PubMed Central \n    \n                    Google Scholar \n                Swami, A. Non-Gaussian mixture models for detection and estimation in heavy-tailed noise. In Proceedings of the 2000 IEEE International Conference on Acoustics, Speech, and Signal Processing 3802–3805 (IEEE, 2000).Turlach, B. A. & Weingessel, A. quadprog: functions to solve quadratic programming problems. R package version 1.5-5 (2013).Duchi, J. Sequential convex programming, notes for EE364b: Convex Optimization II (Stanford University, 2018).SatijaLab. Analysis, visualization, and integration of spatial datasets with Seurat. https://satijalab.org/seurat/articles/spatial_vignette.html (2020).Download referencesAcknowledgementsWe thank R. Stickels for providing valuable input on the analysis. We thank members of the Chen lab, Irizarry lab and Macosko lab for helpful discussions. D.M.C. was supported by a Fannie and John Hertz Foundation Fellowship and an NSF Graduate Research Fellowship. This work was supported by an NIH Early Independence Award (1DP5OD024583 to F.C.), the Burroughs Wellcome Fund (F.C.) and the NHGRI (R01HG010647 to E.Z.M. and F.C.) as well as the Schmidt Fellows Program at the Broad Institute and the Stanley Center for Psychiatric Research. R.A.I. was supported by NIH grants R35GM131802 and R01HG005220.FundingOpen Access funding enabled and organized by Projekt DEAL.Author informationAuthor notesThese authors contributed equally: Fei Chen, Rafael A. Irizarry.Authors and AffiliationsDepartment of Electrical Engineering and Computer Science, MIT, Cambridge, MA, USADylan M. CableBroad Institute of Harvard and MIT, Cambridge, MA, USADylan M. Cable, Evan Murray, Luli S. Zou, Aleksandrina Goeva, Evan Z. Macosko & Fei ChenDepartment of Data Science, Dana-Farber Cancer Institute, Boston, MA, USADylan M. Cable, Luli S. Zou & Rafael A. IrizarryDepartment of Biostatistics, Harvard University, Boston, MA, USALuli S. Zou & Rafael A. IrizarryDepartment of Psychiatry, Massachusetts General Hospital, Boston, MA, USAEvan Z. MacoskoDepartment of Stem Cell and Regenerative Biology, Harvard University, Cambridge, MA, USAFei ChenAuthorsDylan M. CableView author publicationsYou can also search for this author in\n                        PubMed Google ScholarEvan MurrayView author publicationsYou can also search for this author in\n                        PubMed Google ScholarLuli S. ZouView author publicationsYou can also search for this author in\n                        PubMed Google ScholarAleksandrina GoevaView author publicationsYou can also search for this author in\n                        PubMed Google ScholarEvan Z. MacoskoView author publicationsYou can also search for this author in\n                        PubMed Google ScholarFei ChenView author publicationsYou can also search for this author in\n                        PubMed Google ScholarRafael A. IrizarryView author publicationsYou can also search for this author in\n                        PubMed Google ScholarContributionsD.M.C., F.C., R.A.I. and E.Z.M. conceived the study. F.C., E.M. and E.Z.M. designed the Slide-seq experiment. E.M. generated the Slide-seq data. D.M.C., R.A.I. and F.C. developed the statistical methods. D.M.C., F.C., R.A.I. and E.Z.M. designed the analysis. D.M.C., R.A.I., F.C., A.G. and L.S.Z. analyzed the data. D.M.C., F.C., R.A.I., E.Z.M. and L.S.Z. wrote the manuscript. All authors read and approved the final manuscript.Corresponding authorsCorrespondence to\n                Fei Chen or Rafael A. Irizarry.Ethics declarations\nCompeting interests\nThe authors declare no competing interests.\nAdditional informationPublisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations.Supplementary informationSupplementary InformationSupplementary Methods, Table 1 and Figs. 1–27.Reporting SummarySupplementary Table 2Rights and permissionsReprints and PermissionsAbout this articleCite this articleCable, D.M., Murray, E., Zou, L.S. et al. Robust decomposition of cell type mixtures in spatial transcriptomics.\n                    Nat Biotechnol 40, 517–526 (2022). https://doi.org/10.1038/s41587-021-00830-wDownload citationReceived: 07 May 2020Accepted: 31 December 2020Published: 18 February 2021Issue Date: April 2022DOI: https://doi.org/10.1038/s41587-021-00830-wShare this articleAnyone you share the following link with will be able to read this content:Get shareable linkSorry, a shareable link is not currently available for this article.Copy to clipboard\n                            Provided by the Springer Nature SharedIt content-sharing initiative\n                        \nSubjects\n\nBiotechnologyGenomicsStatistical methodsTranscriptomics\n\n\n\n\n\n\n\n\n\n\n\nYou have full access to this article via your institution.\n\n\nDownload PDF\n\n\n\n\n\n\n\nYou have full access to this article via Gordon Library, WPI\n\n\nDownload PDF\n\n\n\n\n\n\n\n\nSectionsFiguresReferencesAbstractMainResultsDiscussionMethodsData availabilityCode availabilityReferencesAcknowledgementsFundingAuthor informationEthics declarationsAdditional informationSupplementary informationRights and permissionsAbout this article\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\nFig. 1: Spatial transcriptomics data present challenges for cell type learning.View in articleFull size imageFig. 2: RCTD enables cross-platform learning of cell types.View in articleFull size imageFig. 3: RCTD performs cross-platform detection and decomposition of doublets.View in articleFull size imageFig. 4: RCTD applied to cell type learning in Slide-seq datasets.View in articleFull size imageFig. 5: RCTD maps cell types and subtypes in Slide-seq hippocampus data.View in articleFull size imageFig. 6: RCTD enables the detection of cell-type-specific spatial patterns of gene expression.View in articleFull size image\nStickels, R. R. et al. Sensitive spatial genome wide expression profiling at cellular resolution. Nature Biotechnology (in the press).10x Genomics. 10x Genomics: Visium spatial gene expression (2020).Vickovic, S. et al. High-definition spatial transcriptomics for in situ tissue profiling. Nat. Methods 16, 987–990 (2019).Article CAS PubMed PubMed Central \n                    Google Scholar Pelkey, K. A. et al. Hippocampal GABAergic inhibitory interneurons. Physiol. Rev. 97, 1619–1747 (2017).Article CAS PubMed PubMed Central \n                    Google Scholar Cembrowski, M. S. et al. The subiculum is a patchwork of discrete subregions. elife 7, e37701 (2018).Article PubMed PubMed Central \n                    Google Scholar Edsgärd, D., Johnsson, P. & Sandberg, R. Identification of spatial expression trends in single-cell gene expression data. Nat. Methods 15, 339–342 (2018).Article PubMed PubMed Central \n                    Google Scholar Sun, S., Zhu, J. & Zhou, X. Statistical analysis of spatial expression patterns for spatially resolved transcriptomic studies. Nat. Methods 17, 193–200 (2020).Article CAS PubMed PubMed Central \n                    Google Scholar Svensson, V., Teichmann, S. A. & Stegle, O. SpatialDE: identification of spatially variable genes. Nat. Methods 15, 343–346 (2018).Article CAS PubMed PubMed Central \n                    Google Scholar Wagner, A., Regev, A. & Yosef, N. Revealing the vectors of cellular identity with single-cell genomics. Nat. Biotechnol. 34, 1145–1160 (2016).Article PubMed PubMed Central \n                    Google Scholar Regev, A. et al. Science forum: the Human Cell Atlas. eLife 6, e27041 (2017).Article PubMed PubMed Central \n                    Google Scholar Rodriques, S. G. et al. Slide-seq: a scalable technology for measuring genome-wide expression at high spatial resolution. Science 363, 1463–1467 (2019).Article CAS PubMed PubMed Central \n                    Google Scholar Stuart, T. et al. Comprehensive integration of single-cell data. Cell 177, 1888–1902 (2019).Article CAS PubMed PubMed Central \n                    Google Scholar Moncada, R. et al. Integrating microarray-based spatial transcriptomics and single-cell RNA-seq reveals tissue architecture in pancreatic ductal adenocarcinomas. Nat. Biotechnol. 38, 333–342 (2020).Article CAS PubMed \n                    Google Scholar Townes, F. W., Hicks, S. C., Aryee, M. J. & Irizarry, R. A. Feature selection and dimension reduction for single-cell RNA-seq based on a multinomial model. Genome Biol. 20, 295 (2019).Article CAS PubMed PubMed Central \n                    Google Scholar Hafemeister, C. & Satija, R. Normalization and variance stabilization of single-cell RNA-seq data using regularized negative binomial regression. Genome Biol. 20, 296 (2019).Article CAS PubMed PubMed Central \n                    Google Scholar Pliner, H. A., Shendure, J. & Trapnell, C. Supervised classification enables rapid annotation of cell atlases. Nat. Methods 16, 983–986 (2019).Article CAS PubMed PubMed Central \n                    Google Scholar Leek, J. T. et al. Tackling the widespread and critical impact of batch effects in high-throughput data. Nat. Rev. Genet. 11, 733–739 (2010).Article CAS PubMed \n                    Google Scholar Bakken, T. E. et al. Single-nucleus and single-cell transcriptomes compared in matched cortical cell types. PLoS ONE 13, e0209648 (2018).Tsoucas, D. et al. Accurate estimation of cell-type composition from gene expression data. Nat. Commun. 10, 2975 (2019).Article PubMed PubMed Central \n                    Google Scholar Kozareva, V. et al. A transcriptomic atlas of the mouse cerebellum reveals regional specializations and novel cell types. Preprint at bioRxiv https://doi.org/10.1101/2020.03.04.976407 (2020).Saunders, A. et al. Molecular diversity and specializations among the cells of the adult mouse brain. Cell 174, 1015–1030 (2018).Article CAS PubMed PubMed Central \n                    Google Scholar Brown, A. M. et al. Molecular layer interneurons shape the spike activity of cerebellar Purkinje cells. Sci. Rep. 9, 1742 (2019).Article PubMed PubMed Central \n                    Google Scholar Tasic, B. et al. Adult mouse cortical cell taxonomy revealed by single cell transcriptomics. Nat. Neurosci. 19, 335–346 (2016).Article CAS PubMed PubMed Central \n                    Google Scholar Zhang, M. et al. Molecular, spatial and projection diversity of neurons in primary motor cortex revealed by in situ single-cell transcriptomics. Preprint at bioRxiv https://doi.org/10.1101/2020.06.04.105700 (2020).Sunkin, S. M. et al. Allen Brain Atlas: an integrated spatio-temporal portal for exploring the central nervous system. Nucleic Acids Res. 41, D996–D1008 (2012).Article PubMed PubMed Central \n                    Google Scholar Capogna, M. Neurogliaform cells and other interneurons of stratum lacunosum-moleculare gate entorhinal–hippocampal dialogue. J. Physiol. 589, 1875–1883 (2011).Article CAS PubMed \n                    Google Scholar Leão, R. N. et al. OLM interneurons differentially modulate CA3 and entorhinal inputs to hippocampal CA1 neurons. Nat. Neurosci. 15, 1524–1530 (2012).Article PubMed Central \n                    Google Scholar Gampe, K. et al. NTPDase2 and purinergic signaling control progenitor cell proliferation in neurogenic niches of the adult mouse brain. Stem Cells 33, 253–264 (2015).Article CAS PubMed PubMed Central \n                    Google Scholar Dikow, N. et al. 3p25.3 microdeletion of GABA transporters SLC6A1 and SLC6A11 results in intellectual disability, epilepsy and stereotypic behavior. Am. J. Med. Genet. A 164, 3061–3068 (2014).Article CAS \n                    Google Scholar Lee, T.-S. et al. GAT1 and GAT3 expression are differently localized in the human epileptogenic hippocampus. Acta Neuropathol. 111, 351–363 (2006).Article CAS PubMed \n                    Google Scholar Kulkarni, A., Anderson, A. G., Merullo, D. P. & Konopka, G. Beyond bulk: a review of single cell transcriptomics methodologies and applications. Curr. Opin. Biotechnol. 58, 129–136 (2019).Article CAS PubMed PubMed Central \n                    Google Scholar Halpern, K. B. et al. Paired-cell sequencing enables spatial gene expression mapping of liver endothelial cells. Nat. Biotechnol. 36, 962–970 (2018).Article CAS PubMed PubMed Central \n                    Google Scholar Sakamoto, Y., Ishiguro, M. & Kitagawa, G. Akaike Information Criterion Statistics 1st edn, Vol. 1 (Springer Netherlands, 1986).Zhou, M., Li, L., Dunson, D. & Carin, L. Lognormal and gamma mixed negative binomial regression. Proc. Int. Conf. Mach. Learn. 2012, 1343–1350 (2012).PubMed PubMed Central \n                    Google Scholar Swami, A. Non-Gaussian mixture models for detection and estimation in heavy-tailed noise. In Proceedings of the 2000 IEEE International Conference on Acoustics, Speech, and Signal Processing 3802–3805 (IEEE, 2000).Turlach, B. A. & Weingessel, A. quadprog: functions to solve quadratic programming problems. R package version 1.5-5 (2013).Duchi, J. Sequential convex programming, notes for EE364b: Convex Optimization II (Stanford University, 2018).SatijaLab. Analysis, visualization, and integration of spatial datasets with Seurat. https://satijalab.org/seurat/articles/spatial_vignette.html (2020).\n\n\n\n\n\n\n\n\n\n\n\n                    Nature Biotechnology (Nat Biotechnol)\n                \n\nISSN 1546-1696 (online)\n    \n\nISSN 1087-0156 (print)\n    \n\n\n\n\n\n\n\n\nnature.com sitemap\n\n\n\n\n\nAbout us\nPress releases\nPress office\nContact us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDiscover content\n\nJournals A-Z\nArticles by subject\nNano\nProtocol Exchange\nNature Index\n\n\n\nPublishing policies\n\nNature portfolio policies\nOpen access\n\n\n\nAuthor & Researcher services\n\nReprints & permissions\nResearch data\nLanguage editing\nScientific editing\nNature Masterclasses\nNature Research Academies\nResearch Solutions\n\n\n\nLibraries & institutions\n\nLibrarian service & tools\nLibrarian portal\nOpen research\nRecommend to library\n\n\n\nAdvertising & partnerships\n\nAdvertising\nPartnerships & Services\nMedia kits\nBranded content\n\n\n\nCareer development\n\nNature Careers\nNature  Conferences\nNature  events\n\n\n\nRegional websites\n\nNature Africa\nNature China\nNature India\nNature Italy\nNature Japan\nNature Korea\nNature Middle East\n\n\n\nLegal & Privacy\n\nPrivacy Policy\nUse of cookies\nManage cookies/Do not sell my data\nLegal notice\nAccessibility statement\nTerms & Conditions\nCalifornia Privacy Statement\n\n\n\n\n\n\n\n\n\n\n© 2022 Springer Nature Limited\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose banner\n\n\n\n\n\n\nClose\n\n\n\n\n\n\nSign up for the Nature Briefing newsletter — what matters in science, free to your inbox daily.\n\n\n\n\n\nEmail address\n\n\nSign up\n\n\n\nI agree my information will be processed in accordance with the Nature and Springer Nature Limited Privacy Policy.\n\n\n\n\n\n\n\n\n\n\nClose banner\n\n\n\n\n\n\nClose\n\n\n\nGet the most important science stories of the day, free in your inbox.\nSign up for Nature Briefing\n            \n\n\n\n\n\n\n\n\n\n\n"
    }
}